Repository: zhen00fa/helm-openstack
Catalog: openstack-helm/doc/source/locale/*/LC_MESSAGES/doc-install.po
Languages: de

source: Setup Clients on the host and assemble the charts
de: Richten Sie Clients auf dem Host ein und stellen Sie die Charts zusammen

source: Setup the gateway to the public network
de: Richten Sie das Gateway zum öffentlichen Netzwerk ein

source: System Requirements
de: System Anforderungen

source: Test this by ssh'ing to a node and then executing a command with 'sudo'. Neither operation should require a password.
de: Testen Sie dies, indem Sie einen ssh-Befehl an einen Knoten senden und dann einen Befehl mit 'sudo' ausführen. Keine Operation sollte ein Passwort erfordern.

source: The OpenStack clients and Kubernetes RBAC rules, along with assembly of the charts can be performed by running the following commands:
de: Die OpenStack-Clients und Kubernetes-RBAC-Regeln können zusammen mit dem Zusammenstellen der Charts ausgeführt werden, indem Sie die folgenden Befehle ausführen:

source: The `./tools/deployment/multinode/kube-node-subnet.sh` script requires docker to run.
de: Das Skript ``./tools/deployment/multinode/kube-node-subnet.sh`` erfordert das Ausführen von docker.

source: The ``.svc.cluster.local`` address is required to allow the OpenStack client to communicate without being routed through proxy servers. The IP address ``172.17.0.1`` is the advertised IP address for the Kubernetes API server. Replace the addresses if your configuration does not match the one defined above.
de: Die ``.svc.cluster.local``-Adresse ist erforderlich, damit der OpenStack-Client kommunizieren kann, ohne über Proxy-Server weitergeleitet zu werden. Die IP-Adresse ``172.17.0.1`` ist die angekündigte IP-Adresse für den Kubernetes-API-Server. Ersetzen Sie die Adressen, wenn Ihre Konfiguration nicht mit der oben definierten Konfiguration übereinstimmt.

source: The default FQDN's for OpenStack-Helm are
de: Die Standard-FQDNs für OpenStack-Helm sind

source: The example above uses the default values used by ``openstack-helm-infra``.
de: Das obige Beispiel verwendet die Standardwerte von ``openstack-helm-infra``.

source: The following commands all assume that they are run from the ``/opt/openstack-helm`` directory.
de: Die folgenden Befehle gehen alle davon aus, dass sie vom Verzeichnis ``/opt/openstack-helm`` ausgeführt werden.

source: The following commands all assume that they are run from the ``openstack-helm`` directory and the repos have been cloned as above.
de: Die folgenden Befehle gehen alle davon aus, dass sie vom Verzeichnis ``openstack-helm`` ausgeführt werden und die Repos wie oben geklont wurden.

source: The installation procedures below, will take an administrator from a new ``kubeadm`` installation to OpenStack-Helm deployment.
de: Die folgenden Installationsverfahren führen einen Administrator von einer neuen ``kubeadm``-Installation zur OpenStack-Helm-Bereitstellung.

source: The recommended minimum system requirements for a full deployment are:
de: Die empfohlenen Mindestsystemanforderungen für eine vollständige Bereitstellung sind:

source: The script below configures Ceph to use filesystem directory-based storage. To configure a custom block device-based backend, please refer to the ``ceph-osd`` `values.yaml <https://github.com/openstack/openstack-helm/blob/master/ceph-osd/values.yaml>`_.
de: Das folgende Skript konfiguriert Ceph für die Verwendung von Dateisystem-basiertem Speicher. Um ein benutzerdefiniertes Block-Gerät-basiertes Backend zu konfigurieren, beziehen Sie sich bitte auf die ``ceph-osd`` `values.yaml <https://github.com/openstack/openstack-helm/blob/master/ceph-osd/values.yaml>`_.

source: The upstream Ceph image repository does not currently pin tags to specific Ceph point releases. This can lead to unpredictable results in long-lived deployments. In production scenarios, we strongly recommend overriding the Ceph images to use either custom built images or controlled, cached images.
de: Das vorgelagerte Ceph-Bild-Repository bindet derzeit keine Tags an bestimmte Ceph-Point-Releases. Dies kann zu unvorhersehbaren Ergebnissen in langlebigen Bereitstellungen führen. In Produktionsszenarien empfehlen wir dringend, die Ceph-Abbilder zu überschreiben, um entweder benutzerdefinierte Abbilder oder gesteuerte, zwischengespeicherte Abbilder zu verwenden.

source: These commands will restore the environment back to a clean Kubernetes deployment, that can either be manually removed or over-written by restarting the deployment process. It is recommended to restart the host before doing so to ensure any residual state, eg. Network interfaces are removed.
de: Mit diesen Befehlen wird die Umgebung wieder in einer sauberen Kubernetes-Bereitstellung wiederhergestellt, die entweder manuell entfernt oder überschrieben werden kann, indem der Bereitstellungsprozess neu gestartet wird. Es wird empfohlen, den Host vorher neu zu starten, um einen Reststatus sicherzustellen, z.B. Netzwerkschnittstellen werden entfernt.

source: This command will deploy a single node KubeADM administered cluster. This will use the parameters in ``${OSH_INFRA_PATH}/playbooks/vars.yaml`` to control the deployment, which can be over-ridden by adding entries to ``${OSH_INFRA_PATH}/tools/gate/devel/local-vars.yaml``.
de: Mit diesem Befehl wird ein KubeADM-Cluster mit einem einzigen Knoten bereitgestellt. Dies verwendet die Parameter in ``${OSH_INFRA_PATH}/playbooks/vars.yaml``, um die Bereitstellung zu steuern, die durch Hinzufügen von Einträgen zu ``${OSH_INFRA_PATH}/tools/gate/devel/local-vars.yaml``.

source: This guide assumes that users wishing to deploy behind a proxy have already defined the conventional proxy environment variables ``http_proxy``, ``https_proxy``, and ``no_proxy``.
de: In diesem Handbuch wird davon ausgegangen, dass Benutzer, die hinter einem Proxy-Server installieren möchten, bereits die herkömmlichen Proxy-Umgebungsvariablen ``http_proxy``, ``https_proxy`` und ``no_proxy`` definiert haben.

source: This guide covers the minimum number of requirements to get started.
de: In diesem Handbuch wird die Mindestanzahl von Anforderungen für den Start beschrieben.

source: This installation, by default will use Google DNS servers, 8.8.8.8 or 8.8.4.4 and updates ``resolv.conf``. These DNS nameserver entries can be changed by updating file ``openstack-helm-infra/tools/images/kubeadm-aio/assets/opt/playbooks/vars.yaml`` under section ``external_dns_nameservers``.
de: Diese Installation verwendet standardmäßig die Google DNS-Server 8.8.8.8 oder 8.8.4.4 und aktualisiert ``resolv.conf``. Diese DNS-Nameserver-Einträge können geändert werden, indem die Datei ``openstack-helm-infra/tools/images/kubeadm-aio/assets/opt/playbooks/vars.yaml`` im Abschnitt `` external_dns_nameservers`` aktualisiert wird.

source: This installation, by default will use Google DNS servers, 8.8.8.8 or 8.8.4.4 and updates resolv.conf. These DNS nameserver entries can be changed by updating file ``/opt/openstack-helm-infra/tools/images/kubeadm-aio/assets/opt/playbooks/vars.yaml`` under section ``external_dns_nameservers``. This change must be done on each node in your cluster.
de: Diese Installation verwendet standardmäßig die Google DNS-Server 8.8.8.8 oder 8.8.4.4 und aktualisiert resolv.conf. Diese DNS-Nameserver-Einträge können geändert werden, indem die Datei ``/opt/openstack-helm-infra/tools/images/kubeadm-aio/assets/opt/playbooks/vars.yaml`` im Abschnitt ``external_dns_nameservers`` aktualisiert wird. Diese Änderung muss für jeden Knoten in Ihrem Cluster durchgeführt werden.

source: This will delete all Kubernetes resources generated when the chart was instantiated. However for OpenStack charts, by default, this will not delete the database and database users that were created when the chart was installed. All OpenStack projects can be configured such that upon deletion, their database will also be removed. To delete the database when the chart is deleted the database drop job must be enabled before installing the chart. There are two ways to enable the job, set the job_db_drop value to true in the chart's ``values.yaml`` file, or override the value using the helm install command as follows:
de: Dadurch werden alle Kubernetes-Ressourcen gelöscht, die beim Instanziieren des Charts generiert wurden. Bei OpenStack-Charts werden jedoch standardmäßig nicht die Datenbank- und Datenbankbenutzer gelöscht, die bei der Installation des Charts erstellt wurden. Alle OpenStack-Projekte können so konfiguriert werden, dass ihre Datenbank beim Löschen ebenfalls entfernt wird. Um die Datenbank zu löschen, wenn das Chart gelöscht wird, muss der Datenbank-Drop-Job vor der Installation des Charts aktiviert werden. Es gibt zwei Möglichkeiten, den Job zu aktivieren, den Wert job_db_drop in der Datei ``values.yaml`` des Charts auf true zu setzen oder den Wert mithilfe des Befehls helm install wie folgt zu überschreiben:

source: Throughout this guide the assumption is that the user is: ``ubuntu``. Because this user has to execute root level commands remotely to other nodes, it is advised to add the following lines to ``/etc/sudoers`` for each node:
de: In diesem Handbuch wird angenommen, dass der Benutzer ``ubuntu`` ist. Da dieser Benutzer Befehle auf root-Ebene remote an andere Knoten ausführen muss, wird empfohlen, die folgenden Zeilen für jeden Knoten zu ``/etc/sudoers`` hinzuzufügen:

source: To copy the ssh key to each node, this can be accomplished with the ``ssh-copy-id`` command, for example: *ssh-copy-id ubuntu@192.168.122.178*
de: Um den ssh-Schlüssel auf jeden Knoten zu kopieren, kann dies mit dem Befehl ``ssh-copy-id`` durchgeführt werden, zum Beispiel: *ssh-copy-id ubuntu@192.168.122.178*

source: To delete an installed helm chart, use the following command:
de: Verwenden Sie den folgenden Befehl, um ein installiertes Helm-Chart zu löschen:

source: To generate the key you can use ``ssh-keygen -t rsa``
de: Um den Schlüssel zu generieren, können Sie ``ssh-keygen -t rsa`` benutzen

source: To run further commands from the CLI manually, execute the following to set up authentication credentials::
de: Um weitere Befehle von der CLI manuell auszuführen, führen Sie Folgendes aus, um die Anmeldedaten für die Authentifizierung einzurichten:

source: To tear-down, the development environment charts should be removed first from the 'openstack' namespace and then the 'ceph' namespace using the commands from the `Removing Helm Charts` section. Additionally charts should be removed from the 'nfs' and 'libvirt' namespaces if deploying with NFS backing or bare metal development support. You can run the following commands to loop through and delete the charts, then stop the kubelet systemd unit and remove all the containers before removing the directories used on the host by pods.
de: Zum Abbau sollten die Entwicklungsumgebungsdiagramme zuerst aus dem Namespace ``openstack`` und dann aus dem Namespace ``ceph`` mit den Befehlen aus dem Abschnitt ``Entfernen der Helm-Charts`` entfernt werden. Außerdem sollten Charts aus den Namespaces 'nfs' und 'libvirt' entfernt werden, wenn sie mit Unterstützung für NFS-Unterstützung oder Bare-Metal-Entwicklung bereitgestellt werden. Sie können die folgenden Befehle ausführen, um die Charts zu durchlaufen und zu löschen. Stoppen Sie dann die Kubelet-Systemeinheit und entfernen Sie alle Container, bevor Sie die auf dem Host verwendeten Verzeichnisse durch Pods entfernen.

source: Troubleshooting
de: Fehlerbehebung

source: Two similar options exist to set the FQDN overrides for External DNS mapping.
de: Es gibt zwei ähnliche Optionen, um die FQDN-Überschreibungen für die externe DNS-Zuordnung festzulegen.

source: Until the Ubuntu kernel shipped with 16.04 supports CephFS subvolume mounts by default the `HWE Kernel <../../troubleshooting/ubuntu-hwe-kernel.html>`__ is required to use CephFS.
de: Bis der Ubuntu-Kernel, der mit 16.04 ausgeliefert wird, standardmäßig CephFS-Subvolume-Mounts unterstützt, ist der `HWE-Kernel <../../troubleshooting/ubuntu-hwe-kernel.html>`__ erforderlich, um CephFS zu verwenden.

source: Until the Ubuntu kernel shipped with 16.04 supports CephFS subvolume mounts by default the `HWE Kernel <../troubleshooting/ubuntu-hwe-kernel.html>`__ is required to use CephFS.
de: Bis der Ubuntu-Kernel, der mit 16.04 ausgeliefert wird, standardmäßig CephFS-Subvolume-Mounts unterstützt, ist der `HWE-Kernel <../troubleshooting/ubuntu-hwe-kernel.html>`__ erforderlich, um CephFS zu verwenden.

source: Update your lab/environment DNS server with your appropriate host values creating A Records for the edge node IP's and various FQDN's. Alternatively you can test these settings locally by editing your ``/etc/hosts``. Below is an example with a dummy domain ``os.foo.org`` and dummy Ingress IP ``1.2.3.4``.
de: Aktualisieren Sie Ihren Labor-/Umgebungs-DNS-Server mit Ihren entsprechenden Host-Werten, indem Sie A-Datensätze für die IP-Adressen des Randknotens und verschiedene FQDNs erstellen. Alternativ können Sie diese Einstellungen lokal testen, indem Sie Ihre ``/etc/hosts`` bearbeiten. Unten ist ein Beispiel mit einer Dummy-Domain ``os.foo.org`` und einer Dummy-Ingress-IP ``1.2.3.4``.

source: Using Horizon as an example, find the ``endpoints`` config.
de: Am Beispiel von Horizon finden Sie die Konfiguration ``endpoints``.

source: Using the Helm packages previously pushed to the local Helm repository, run the following commands to instruct tiller to create an instance of the given chart. During installation, the helm client will print useful information about resources created, the state of the Helm releases, and whether any additional configuration steps are necessary.
de: Führen Sie mithilfe der Helm-Pakete, die zuvor in das lokale Helm-Repository gepusht wurden, die folgenden Befehle aus, um Tiller anzuweisen, eine Instanz des angegebenen Charts zu erstellen. Während der Installation wird der Helm-Client nützliche Informationen über die erstellten Ressourcen, den Status der Helm-Versionen und darüber, ob zusätzliche Konfigurationsschritte erforderlich sind, drucken.

source: Verify the *v1beta1/Ingress* resource has a Host with your FQDN value
de: Überprüfen Sie, ob die Ressource *v1beta1/Ingress* über einen Host mit Ihrem FQDN-Wert verfügt

source: We want to change the **public** configurations to match our DNS layouts above. In each Chart ``values.yaml`` is a ``endpoints`` configuration that has ``host_fqdn_override``'s for each API that the Chart either produces or is dependent on. `Read more about how Endpoints are developed <https://docs.openstack.org/openstack-helm/latest/devref/endpoints.html>`__. Note while Glance Registry is listening on a Ingress http endpoint, you will not need to expose the registry for external services.
de: Wir möchten die **public** Konfigurationen so ändern, dass sie unseren obigen DNS-Layouts entsprechen. In jedem Chart ist `values.yaml`` eine `` endpoints`` Konfiguration, die ``host_fqdn_override``s für jede API hat, die das Chart entweder erzeugt oder von der es abhängig ist. `Lesen Sie mehr darüber, wie Endpunkte entwickelt werden <https://docs.openstack.org/openstack-helm/latest/devref/endpoints.html>`__ . Hinweis: Während Glance Registry einen Ingress-HTTP-Endpunkt überwacht, müssen Sie die Registrierung für externe Dienste nicht verfügbar machen.

source: You can use any Kubernetes deployment tool to bring up a working Kubernetes cluster for use with OpenStack-Helm. For production deployments, please choose (and tune appropriately) a highly-resilient Kubernetes distribution, e.g.:
de: Sie können ein beliebiges Kubernetes-Bereitstellungstool verwenden, um einen funktionierenden Kubernetes-Cluster zur Verwendung mit OpenStack-Helm aufzurufen. Bei Produktionsbereitstellungen wählen Sie bitte eine hoch belastbare Kubernetes-Distribution aus, z.B.:

source: You can use any Kubernetes deployment tool to bring up a working Kubernetes cluster for use with OpenStack-Helm. This guide describes how to simply stand up a multinode Kubernetes cluster via the OpenStack-Helm gate scripts, which use KubeADM and Ansible. Although this cluster won't be production-grade, it will serve as a quick starting point in a lab or proof-of-concept environment.
de: Sie können ein beliebiges Kubernetes-Bereitstellungstool verwenden, um einen funktionierenden Kubernetes-Cluster zur Verwendung mit OpenStack-Helm aufzurufen. Dieser Leitfaden beschreibt, wie man einen Multinode-Kubernetes-Cluster einfach über die OpenStack-Helm-Gate-Skripte, die KubeADM und Ansible verwenden, aufstellt. Obwohl dieser Cluster keine Produktionsqualität hat, wird er als ein schneller Ausgangspunkt in einer Labor- oder Proof-of-Concept-Umgebung dienen.

source: You may now deploy kubernetes, and helm onto your machine, first move into the ``openstack-helm`` directory and then run the following:
de: Sie können nun kubernetes und helm auf Ihrem Rechner installieren, zuerst in das Verzeichnis ``openstack-helm`` wechseln und dann folgendes ausführen:

source: `Airship <https://airshipit.org/>`_, a declarative open cloud infrastructure platform
de: `Airship <https://airshipit.org/>`_, eine deklarative Open-Cloud-Infrastrukturplattform

source: `KubeADM <https://kubernetes.io/docs/setup/independent/high-availability/>`_, the foundation of a number of Kubernetes installation solutions
de: `KubeADM <https://kubernetes.io/docs/setup/independent/high-availability/> `_, die Grundlage für eine Reihe von Kubernetes Installationslösungen

source: node_one, node_two and node_three below are all worker nodes, children of the master node that the commands below are executed on.
de: node_one, node_two und node_three unten sind alle Worker-Knoten, Kinder des Master-Knotens, auf dem die folgenden Befehle ausgeführt werden.
