Repository: zhen00fa/helm-openstack
Catalog: openstack-helm/doc/source/locale/*/LC_MESSAGES/doc-troubleshooting.po
Languages: de, id

source: Backing up a PVC
de: Ein PVC sichern
id: Mencadangkan PVC

source: Backing up a PVC stored in Ceph, is fairly straigthforward, in this example we use the PVC ``mysql-data-mariadb-server-0`` as an example, but this will also apply to any other services using PVCs eg. RabbitMQ, Postgres.
de: Die Sicherung eines in Ceph gespeicherten PVCs ist ziemlich geradlinig, in diesem Beispiel verwenden wir als Beispiel den PVC-Server ``mysql-data-mariab-server-0``, aber dies gilt auch für alle anderen Dienste, die PVCs verwenden, z. RabbitMQ, Postgres.
id: Mencadangkan PVC yang disimpan di Ceph, cukup ketat, dalam contoh ini kita menggunakan PVC ``mysql-data-mariadb-server-0`` sebagai contoh, tetapi ini juga akan berlaku untuk layanan lain yang menggunakan PVC misalnya. RabbitMQ, Postgres.

source: Before proceeding, it is important to ensure that you have deployed a client key in the namespace you wish to fulfill ``PersistentVolumeClaims``. To verify that your deployment namespace has a client key:
de: Bevor Sie fortfahren, müssen Sie sicherstellen, dass Sie einen Clientschlüssel in dem Namespace implementiert haben, den Sie mit ``PersistentVolumeClaims`` erfüllen möchten. So überprüfen Sie, ob Ihr Implementierungsnamespace über einen Clientschlüssel verfügt:
id: Sebelum melanjutkan, penting untuk memastikan bahwa Anda telah menggunakan kunci klien di ruang nama (namespace) yang ingin Anda penuhi ``PersistentVolumeClaims``. Untuk memverifikasi bahwa namespace penyebaran Anda memiliki kunci klien:

source: Bugs and Feature requests
de: Bugs und Feature Anfragen
id: Permintaan Bug dan Fitur

source: Ceph Deployment Status
de: Ceph-Bereitstellungsstatus
id: Status Penerapan Ceph

source: Ceph Validating PVC Operation
de: Ceph Validierung des PVC-Betriebs
id: Ceph Memvalidasi Operasi PVC

source: Ceph Validating StorageClass
de: Ceph Validierung von StorageClass

source: Channels
de: Kanäle

source: Database Deployments
de: Datenbankbereitstellungen

source: First, we want to validate that Ceph is working correctly. This can be done with the following Ceph command:
de: Zuerst wollen wir bestätigen, dass Ceph korrekt funktioniert. Dies kann mit dem folgenden Ceph-Befehl geschehen:
id: Pertama, kami ingin memvalidasi bahwa Ceph berfungsi dengan benar. Ini dapat dilakukan dengan perintah Ceph berikut:

source: Getting help
de: Hilfe bekommen
id: Mendapatkan bantuan

source: Join us on `IRC <irc://chat.freenode.net:6697/openstack-helm>`_: #openstack-helm on freenode
de: Begleiten Sie uns auf `IRC <irc://chat.freenode.net:6697/openstack-helm>`_: #openstack-helm auf freenode
id: Bergabunglah dengan kami `IRC <irc://chat.freenode.net:6697/openstack-helm>`_: #openstack-helm on freenode

source: Join us on `Slack <http://slack.k8s.io/>`_ - #openstack-helm
de: Begleiten Sie uns auf `Slack <http://slack.k8s.io/>`_ - #openstack-helm
id: Bergabunglah dengan kami `Slack <http://slack.k8s.io/>`_ - #openstack-helm

source: Next we can look at the storage class, to make sure that it was created correctly:
de: Als nächstes können wir uns die Speicherklasse ansehen, um sicherzustellen, dass sie korrekt erstellt wurde:
id: Selanjutnya kita dapat melihat kelas penyimpanan, untuk memastikan bahwa itu dibuat dengan benar:

source: Note: This step is not relevant for PVCs within the same namespace Ceph was deployed.
de: Hinweis: Dieser Schritt ist nicht relevant für PVCs in demselben Namespace, in dem Ceph implementiert wurde.
id: Catatan: Langkah ini tidak relevan untuk PVC dalam ruang nama (namespace) yang sama Ceph dikerahkan.

source: Once this has been done the workload can be restarted.
de: Sobald dies erledigt ist, kann die Arbeitslast neu gestartet werden.
id: Setelah ini selesai, beban kerja (workload) dapat dimulai kembali.

source: PVC Preliminary Validation
de: PVC-Vorprüfung
id: Validasi Pendahuluan PVC

source: Persistent Storage
de: Dauerspeicher
id: Penyimpanan Persisten

source: Restoring is just as straightforward. Once the workload consuming the device has been stopped, and the raw RBD device removed the following will import the back up and create a device:
de: Das Wiederherstellen ist genauso einfach. Sobald die Arbeitslast, die das Gerät verbraucht, beendet wurde und das RBD-Gerät entfernt wurde, wird das Folgende in die Sicherung importiert und ein Gerät erstellt:
id: Memulihkan sama mudahnya. Setelah beban kerja yang memakan perangkat telah dihentikan, dan perangkat RBD mentah yang dihapus berikut ini akan mengimpor cadangan dan membuat perangkat:

source: Sometimes things go wrong. These guides will help you solve many common issues with the following:
de: Manchmal gehen Dinge schief. Diese Handbücher helfen Ihnen bei der Lösung vieler häufig auftretender Probleme:
id: Terkadang ada yang salah. Panduan ini akan membantu Anda memecahkan banyak masalah umum dengan hal-hal berikut:

source: The parameters are what we're looking for here. If we see parameters passed to the StorageClass correctly, we will see the ``ceph-mon.ceph.svc.cluster.local:6789`` hostname/port, things like ``userid``, and appropriate secrets used for volume claims.
de: Nach den Parametern suchen wir hier. Wenn wir sehen, dass die Parameter korrekt an die StorageClass übergeben werden, sehen wir den ``ceph-mon.ceph.svc.cluster.local:6789`` Hostnamen/Port, Dinge wie ``userid`` und entsprechende Secrets, die für Volume Claims verwendet werden .
id: Parameternya adalah apa yang kami cari di sini. Jika kita melihat parameter yang dikirimkan ke StorageClass dengan benar, kita akan melihat hostname/port ``ceph-mon.ceph.svc.cluster.local: 6789``, hal-hal seperti ``userid``, dan rahasia yang sesuai digunakan untuk klaim volume .

source: This guide is to help users debug any general storage issues when deploying Charts in this repository.
de: Dieser Leitfaden soll Benutzern helfen, allgemeine Speicherprobleme beim Bereitstellen von Charts in diesem Repository zu beheben.
id: Panduan ini untuk membantu pengguna mendebug masalah penyimpanan umum apa pun saat menerapkan Charts dalam repositori ini.

source: This guide is to help users debug any general storage issues when deploying charts in this repository.
de: Dieses Handbuch soll Benutzern helfen, allgemeine Speicherprobleme beim Bereitstellen von Diagrammen in diesem Repository zu beheben.
id: Panduan ini untuk membantu pengguna mendebug masalah penyimpanan umum apa pun saat menerapkan grafik di repositori ini.

source: To deploy the HWE kernel, prior to deploying Kubernetes and OpenStack-Helm the following commands should be run on each node:
de: Zur Bereitstellung des HWE-Kernels sollten vor der Bereitstellung von Kubernetes und OpenStack-Helm die folgenden Befehle auf jedem Knoten ausgeführt werden:
id: Untuk menyebarkan kernel HWE, sebelum menyebarkan Kubernetes dan OpenStack-Helm, perintah berikut harus dijalankan pada setiap node:

source: To make use of CephFS in Ubuntu the HWE Kernel is required, until the issue described `here <https://github.com/kubernetes-incubator/external-storage/issues/345>`_ is fixed.
de: Um CephFS in Ubuntu nutzen zu können, wird der HWE-Kernel benötigt, bis das Problem hier beschrieben wird <https://github.com/kubernetes-incubator/external-storage/issues/345>`_ ist behoben.
id: Untuk menggunakan CephFS di Ubuntu, Kernel HWE diperlukan, sampai masalah tersebut dijelaskan `here <https://github.com/kubernetes-incubator/external-storage/issues/345>`_ telah diperbaiki.

source: To test MariaDB, do the following:
de: Um MariaDB zu testen, machen Sie folgendes:
id: Untuk menguji MariaDB, lakukan hal berikut:

source: To validate persistent volume claim (PVC) creation, we've placed a test manifest `here <https://raw.githubusercontent.com/openstack/openstack-helm/master/tests/pvc-test.yaml>`_. Deploy this manifest and verify the job completes successfully.
de: Um die Erstellung eines persistenten Volumenanspruchs (PVC) zu validieren, haben wir ein Testmanifest `hier platziert <https://raw.githubusercontent.com/openstack/openstack-helm/master/tests/pvc-test.yaml>`_. Stellen Sie dieses Manifest bereit und überprüfen Sie, ob der Job erfolgreich abgeschlossen wurde.
id: Untuk memvalidasi pembuatan persistent volume claim (PVC, kami menempatkan manifes tes `here <https://raw.githubusercontent.com/openstack/openstack-helm/master/tests/pvc-test.yaml>`_. Gunakan manifes ini dan verifikasi bahwa pekerjaan telah selesai dengan sukses.

source: Troubleshooting
de: Fehlerbehebung
id: Penyelesaian masalah

source: Use one of your Ceph Monitors to check the status of the cluster. A couple of things to note above; our health is `HEALTH\_OK`, we have 3 mons, we've established a quorum, and we can see that all of our OSDs are up and in the OSD map.
de: Verwenden Sie einen Ihrer Ceph-Monitore, um den Status des Clusters zu überprüfen. Ein paar Dinge zu beachten; unser Gesundheitszustand ist HEALTH \_OK`, wir haben 3 Mons, wir haben ein Quorum eingerichtet, und wir können sehen, dass alle unsere OSDs in der OSD-Karte aufgeführt sind.
id: Gunakan salah satu Ceph Monitors Anda untuk memeriksa status cluster. Beberapa hal yang perlu diperhatikan di atas; kesehatan kita adalah `HEALTH\_OK`, kita memiliki 3 mons, kita telah membentuk kuorum, dan kita dapat melihat bahwa semua OSD kita sudah naik dan di peta OSD.

source: When discovering a new bug, please report a bug in `Storyboard <https://storyboard.openstack.org/#!/project/886>`_.
de: Wenn Sie einen neuen Fehler entdecken, melden Sie bitte einen Fehler im `Storyboard <https://storyboard.openstack.org/#!/project/886>`_.
id: Saat menemukan bug baru, laporkan bug di `Storyboard <https://storyboard.openstack.org/#!/project/886>`_.

source: Without this, your RBD-backed PVCs will never reach the ``Bound`` state. For more information, see how to `activate namespace for ceph <../install/multinode.html#activating-control-plane-namespace-for-ceph>`_.
de: Ohne dies werden Ihre RBD-unterstützten PVCs niemals den ``Bound`` -Zustand erreichen. Weitere Informationen finden Sie unter `namespace für ceph aktivieren <../install/multinode.html#activating-control-plane-namespace-for-ceph>`_.
id: Tanpa ini, RBD-backed PVCs Anda tidak akan pernah mencapai status ``Bound``. Untuk informasi lebih lanjut, lihat caranya `activate namespace for ceph <../install/multinode.html#activating-control-plane-namespace-for-ceph>`_.

source: Installation
id: Instalasi
