Repository: zhen00fa/helm-openstack
Catalog: openstack-helm/doc/source/locale/*/LC_MESSAGES/doc-specs.po
Languages: id

source: 1) Prepare scripts:
id: 1) Siapkan skrip:

source: 1. For each chart, add a new entry ``oci_image_registry:`` under ``endpoints:`` in ``values.yaml``. The entry ``oci_image_registry:`` has the ``auth:`` section which provides the credentials for accessing registry images and an option ``enabled:`` to determine whether images authentication is required or not. The registry basic information would also be included for generating the registry URL by the endpoint lookup functions. Also add a new entry ``oci_image_registry:`` under ``secrets:`` to indicate the secret name. In order to create the secret that holds the provided credentials, add a new component ``secret_registry`` in ``manifests:`` section. For example:
id: 1. Untuk setiap chart, tambahkan entri baru ``oci_image_registry:`` di bawah ``endpoints:`` di ``values.yaml``. Entri ``oci_image_registry:`` memiliki bagian ``auth:`` yang menyediakan kredensial untuk mengakses image registri dan opsi ``enabled:`` untuk menentukan apakah otentikasi image diperlukan atau tidak. Informasi dasar registri juga akan dimasukkan untuk menghasilkan URL registri oleh fungsi pencarian endpoint. Juga tambahkan entri baru ``oci_image_registry:`` di bawah ``secrets:`` untuk menunjukkan nama rahasia. Untuk membuat rahasia yang memegang kredensial yang disediakan, tambahkan komponen baru ``secret_registry`` di bagian ``manifes:``. Sebagai contoh:

source: 2 Replace occurrence of ``ceph.yaml`` with ``tenant-ceph.yaml``
id: 2 Ganti kemunculan ``ceph.yaml`` dengan ``tenant-ceph.yaml``

source: 2) Deploy ingress chart:
id: 2) Menyebarkan ingress chart:

source: 3 For tenant Ceph, no need to deploy ceph-provisioners. Update script to ``for CHART in ceph-mon ceph-osd ceph-client; do``
id: 3 untuk tenant Ceph, tidak perlu menggunakan ceph-provisioners. Update skrip ke ``for CHART in ceph-mon ceph-osd ceph-client; do``

source: 3) Deploy Ceph for RBD:
id: 3) Menyebarkan Ceph untuk RBD:

source: 4) Deploy MariaDB, RabbitMQ, Memcached and Keystone:
id: 4) Menyebarkan MariaDB, RabbitMQ, Memcached dan Keystone:

source: 5) Deploy Ceph for Tenant:
id: 5) Menyebarkan Ceph untuk Tenant:

source: 6) Enable Openstack namespace to use Tenant Ceph:
id: 6) Aktifkan Openstack namespace untuk menggunakan Tenant Ceph:

source: 8) Deploy Glance:
id: 8) Menyebarkan Glance:

source: 9) Deploy Cinder:
id: 9) Menyebarkan Cinder:

source: A basic Logging, Monitoring, and Alerting-oriented operations guide must be in place, illustrating for operators (and developers) how to set up and use an example LMA setup for OpenStack and supporting services. It will include instructions on how to perform basic configuration and how to access and use the user interfaces at a high level. It will also link out to more detailed documentation for the LMA tooling itself.
id: Panduan operasi Logging, Monitoring, dan Alerting-oriented dasar harus ada, menggambarkan bagi operator (dan pengembang) bagaimana mengatur dan menggunakan contoh pengaturan LMA untuk OpenStack dan layanan pendukung. Ini akan mencakup instruksi tentang cara melakukan konfigurasi dasar dan cara mengakses dan menggunakan antarmuka pengguna di tingkat tinggi. Ini juga akan menghubungkan ke dokumentasi yang lebih rinci untuk perkakas LMA itu sendiri.

source: A few areas have been identified on changes required. Each of them will be a work item.
id: Beberapa area telah diidentifikasi pada perubahan yang diperlukan. Masing-masing akan menjadi work item.

source: A foundational requirement of 1.0 readiness is the presence of robust gating that will ensure functionality, backward compatibility, and upgradeability. This will allow development to continue and for support for new versions of OpenStack to be added post-1.0. The following gating requirements must be met:
id: Persyaratan mendasar dari kesiapan 1.0 adalah keberadaan gating yang kuat yang akan memastikan fungsionalitas, kompatibilitas mundur (backward compatibility), dan peningkatan kemampuan. Ini akan memungkinkan pengembangan untuk melanjutkan dan untuk dukungan untuk versi baru OpenStack ditambahkan post-1.0. Persyaratan gating berikut harus dipenuhi:

source: A gate will be added to OpenStack-Helm that runs through the developer environment deployment process.
id: Gate akan ditambahkan ke OpenStack-Helm yang dijalankan melalui proses penyebaran lingkungan pengembang.

source: A number of in-progress and planned development efforts must be completed prior to 1.0, to ensure a stable OpenStack-Helm interface thereafter.
id: Sejumlah upaya pengembangan yang sedang berlangsung dan yang direncanakan harus diselesaikan sebelum 1.0, untuk memastikan antarmuka OpenStack-Helm yang stabil sesudahnya.

source: A set of scripts will be provided to exercise the deployed environment that checks the basic functionality of the deployed cloud, driven where possible via OpenStack heat:
id: Seperangkat skrip akan disediakan untuk menjalankan lingkungan yang digunakan yang memeriksa fungsi dasar cloud yang digunakan, didorong jika memungkinkan melalui OpenStack heat:

source: A specification should precede any broad-reaching technical changes or proposals to OpenStack-Helm. Examples of changes requiring a specification include: a standard format to the values.yaml files, multiple backend support for neutron, and the approach for logging and monitoring in OpenStack-Helm. Some additional features will not need an accompanying specification, but may be tied back to an existing specification. An example of this would be introducing a service in OpenStack-Helm that could be included under the scope of a specification already drafted and approved.
id: Spesifikasi harus mendahului setiap perubahan teknis yang luas atau proposal ke OpenStack-Helm. Contoh perubahan yang memerlukan spesifikasi meliputi: format standar untuk file values.yaml, dukungan backend berganda untuk neutron, dan pendekatan untuk logging dan pemantauan di OpenStack-Helm. Beberapa fitur tambahan tidak memerlukan spesifikasi yang menyertainya, tetapi mungkin terikat kembali ke spesifikasi yang ada. Contohnya adalah memperkenalkan layanan di OpenStack-Helm yang dapat dimasukkan dalam lingkup spesifikasi yang telah disusun dan disetujui.

source: Ability to apply custom metadata and uniform format to logs
id: Kemampuan untuk menerapkan metadata kustom dan format seragam untuk log

source: Ability to perform custom queries against metrics collected
id: Kemampuan untuk melakukan kueri kustom terhadap metrik yang dikumpulkan

source: Ability to perform custom queries against stored logs
id: Kemampuan untuk melakukan kueri kustom terhadap log yang tersimpan

source: Above output shows ``http://ceph-rgw.openstack.svc.cluster.local`` which shows that swift is pointing to tenant-ceph.
id: Output di atas menunjukkan ``http://ceph-rgw.openstack.svc.cluster.local`` yang menunjukkan bahwa swift menunjuk ke tenant-ceph.

source: Above output shows that tenant ceph now has 19 pools including one for Cinder.
id: Output di atas menunjukkan bahwa tenant ceph sekarang memiliki 19 pool termasuk satu untuk Cinder.

source: Add Linux Bridge as first alternative for OVS - separate spec needed.
id: Tambahkan Linux Bridge sebagai alternatif pertama untuk OVS - spesifikasi terpisah diperlukan.

source: Add LinuxBridge daemonset
id: Tambahkan daemonset LinuxBridge

source: Add a helm-toolkit function ``helm-toolkit.manifests.secret_registry`` to create a manifest for secret generation. For example:
id: Tambahkan fungsi helm-toolkit ``helm-toolkit.manifests.secret_registry`` untuk membuat manifes untuk pembuatan rahasia. Sebagai contoh:

source: Add a template highlighting the updated values ordering for use in chart development
id: Tambahkan template highlighting urutan nilai yang diperbarui untuk digunakan dalam pengembangan chart

source: Add documentation on how to use LinuxBridge
id: Tambahkan dokumentasi tentang cara menggunakan LinuxBridge

source: Add gate for developer environment
id: Tambahkan gate untuk lingkungan pengembang

source: Add gate job testing VM network connectivity
id: Tambahkan gate job testing konektivitas jaringan VM

source: Add one SDN to see if proposed change is working OK - separate spec needed.
id: Tambahkan satu SDN untuk melihat apakah perubahan yang diajukan berfungsi dengan baik - pisahkan spesifikasi yang diperlukan.

source: Add or remove nodes depending on utilization
id: Tambah atau hapus node tergantung pada pemanfaatan

source: Aggregator also send aggregated logs to Kafka for external tools to consume
id: Aggregator juga mengirim log agregat ke Kafka untuk dikonsumsi oleh alat eksternal

source: Alerting capabilities to notify operators when thresholds exceeded
id: Memperingatkan kemampuan untuk memberi tahu operator ketika ambang melebihi

source: All charts must include sensible configuration values to make the monitoring platform usable by default. These include: static Prometheus configurations for the included exporters, static dashboards for Grafana mounted via configMaps and configurations for Alertmanager out of the box.
id: Semua chart harus menyertakan nilai konfigurasi yang masuk akal untuk membuat platform pemantauan dapat digunakan secara default. Ini termasuk: konfigurasi statis Prometheus untuk eksportir yang disertakan, dasbor statis untuk Grafana yang dipasang melalui configMaps dan konfigurasi untuk Alertmanager di luar kotak.

source: All charts require valid and sensible default values to provide operational value out of the box.
id: Semua chart memerlukan nilai default yang valid dan masuk akal untuk memberikan nilai operasional di luar kotak.

source: All charts should follow design approaches applied to all other OpenStack-Helm charts, including the use of helm-toolkit.
id: Semua chart harus mengikuti pendekatan desain yang diterapkan pada semua chart OpenStack-Helm lainnya, termasuk penggunaan helm-toolkit.

source: All charts should migrate to their appropriate home project as follows:
id: Semua chart harus bermigrasi ke home project yang sesuai sebagai berikut:

source: All keys under top-level keys are listed in alphabetical order, with the exception of the conf key. As some configuration files require a strict ordering of their content, excluding this key from any alphabetical organization is required.
id: Semua kunci di bawah top-level keys terdaftar dalam urutan abjad, dengan pengecualian kunci conf. Karena beberapa file konfigurasi memerlukan urutan konten yang ketat, tidak termasuk kunci ini dari organisasi alfabet apa pun diperlukan.

source: All services in OpenStack-Helm log to stdout and stderr by default
id: Semua layanan di OpenStack-Helm log ke stdout dan stderr secara default

source: All services running within the platform should be subject to the security practices applied to the other OpenStack-Helm charts.
id: Semua layanan yang berjalan dalam platform harus tunduk pada praktik keamanan yang diterapkan pada grafik OpenStack-Helm lainnya.

source: All services should survive node reboots, and their functionality validated following a reboot by a gate.
id: Semua layanan harus selamat dari reboot node, dan fungsinya divalidasi setelah reboot oleh gate.

source: All three charts must include sensible configuration values to make the logging platform usable by default. These include: proper input configurations for Fluentd, proper metadata and formats applied to the logs via Fluentd, sensible indexes created for Elasticsearch, and proper configuration values for Kibana to query the Elasticsearch indexes previously created.
id: Ketiga grafik harus menyertakan nilai konfigurasi yang masuk akal untuk membuat platform logging dapat digunakan secara default. Ini termasuk: konfigurasi input yang tepat untuk Fluentd, metadata yang tepat dan format yang diterapkan pada log melalui Fluentd, indeks yang masuk akal yang dibuat untuk Elasticsearch, dan nilai konfigurasi yang tepat untuk Kibana untuk menanyakan indeks Elasticsearch yang sebelumnya dibuat.

source: Allow the usage of multiple base images in OSH.
id: Izinkan penggunaan beberapa image dasar dalam OSH.

source: Allows different profiles of apache, should some charts require different args for example for the same kind of images, by using yaml dict merges features.
id: Mengizinkan profil apache yang berbeda, jika beberapa bagan memerlukan argumen yang berbeda misalnya untuk jenis image yang sama, dengan menggunakan fitur penggabungan dict yaml.

source: Alter webserver configuration per distro. Different distros have different expectations in terms of path (including a different series of files required), and it would make the operators' life easier by using their expected distro paths.
id: Ubah konfigurasi server web per distro. Distro yang berbeda memiliki harapan yang berbeda dalam hal path (termasuk serangkaian file yang berbeda diperlukan), dan itu akan membuat hidup para operator lebih mudah dengan menggunakan path distro yang mereka harapkan.

source: Alternatives
id: Alternatif

source: Alternatives to decomposable Neutron chart would be to copy whole Neutron chart and create spin-offs with new SDN enabled. This approach has drawbacks of maintaining the whole neutron chart in many places, and copies of standard services may be out of sync with OSH improvements. This implies constant maintenance effort to up to date.
id: Alternatif untuk chart Neutron terurai (decomposable) adalah menyalin seluruh chart Neutron dan membuat spin-off dengan SDN baru diaktifkan. Pendekatan ini memiliki kelemahan dalam mempertahankan bagan neutron keseluruhan di banyak tempat, dan salinan layanan standar mungkin tidak selaras dengan perbaikan OSH. Ini menyiratkan upaya pemeliharaan yang konstan hingga terbaru.

source: Another place where Neutron L2 agent should be pointed is dependencies list in other OpenStack projects. Currently, :code:`nova-compute` has dependency for :code:`ovs-agent` in :code:`nova/values.yaml`, it should be changed to:
id: Tempat lain di mana agen L2 Neutron harus ditunjuk adalah daftar dependensi dalam proyek OpenStack lainnya. Saat ini, :code:`nova-compute` memiliki ketergantungan untuk :code:`ovs-agent` dalam :code:`nova/values.yaml`, harus diubah menjadi:

source: Any other changes to the external interface of OpenStack-Helm
id: Perubahan lain apa pun pada antarmuka eksternal OpenStack-Helm

source: As mentioned before, configuration of L3/DHCP/metadata agent should be adjusted to use LinuxBridge, sample configuration override:
id: Seperti disebutkan sebelumnya, konfigurasi agen L3/DHCP/metadata harus disesuaikan untuk menggunakan LinuxBridge, konfigurasi sampel diganti:

source: Assign Floating IP to VM
id: Tetapkan IP Mengambang (Floating IP) ke VM

source: At this point, curated scripts will be used to deploy OpenStack-Helm services on demand as desired, with documentation provided to allow a new developer to quickly set up either a single or multimode deployment of a reference `OpenStack Compute Kit <https://governance.openstack.org/tc/reference/tags/starter-kit_compute.html>`_ environment with the addition of:
id: Pada titik ini, skrip yang dikurasi (curated) akan digunakan untuk menggunakan layanan OpenStack-Helm sesuai permintaan seperti yang diinginkan, dengan dokumentasi yang disediakan untuk memungkinkan pengembang baru dengan cepat mengatur penyebaran tunggal atau multimode dari referensi `OpenStack Compute Kit <https: // governance.openstack.org/tc/reference/tags/starter-kit_compute.html>`_ lingkungan dengan penambahan:

source: Authentication should be enabled for normal users to access Kube API server via either kubectl command or kube REST API call.
id: Otentikasi harus diaktifkan untuk pengguna normal untuk mengakses server API Kube melalui perintah kubectl atau panggilan API REST kube.

source: Backed by highly available storage
id: Didukung oleh penyimpanan yang sangat tersedia

source: Before drafting a specification, a blueprint should be filed in Storyboard_ along with any dependencies the blueprint requires. Once the blueprint has been registered, submit the specification as a patch set to the specs/ directory using the supplied template.
id: Sebelum menyusun spesifikasi, blueprint harus diajukan di Storyboard_ bersama dengan setiap dependensi yang diperlukan blueprint. Setelah blueprint terdaftar, kirimkan spesifikasi sebagai patch yang disetel ke direktori spesifikasi menggunakan templat yang disediakan.

source: Before using Openstack-Helm to deploy openstack services,
id: Sebelum menggunakan Openstack-Helm untuk menggunakan layanan openstack,

source: Blueprints: 1. osh-logging-framework_
id: Cetak Biru: 1. osh-logging-framework_

source: But above alternatives have limitations and security impact. i.e...require root access to configure on all nodes, all pods can read any configured private registries, all pods can use any images cached on a node [1]_
id: Tetapi alternatif di atas memiliki keterbatasan dan dampak keamanan. i.e ... memerlukan akses root untuk mengkonfigurasi pada semua node, semua pod dapat membaca register pribadi yang dikonfigurasi, semua pod dapat menggunakan image apa pun yang di-cache pada sebuah node [1] _

source: By default, :code:`daemonset_lb_agent` will be set to false to remain default behaviour of installing OVS as networking agent.
id: Secara default, :code:`daemonset_lb_agent` akan disetel ke false untuk tetap menjadi perilaku default menginstal OVS sebagai agen jaringan.

source: Ceph backed Block Storage (cinder)
id: Object Storage (cinder) yang didukung Ceph

source: Ceph backed Object Storage
id: Object Storage yang didukung Ceph

source: Ceph for Tenant:
id: Ceph untuk Tenant:

source: Ceph metrics: total pool usage, latency, health, etc
id: Metrik Ceph: total penggunaan pool, latensi, kesehatan, dll

source: Change ordering of keys across all charts in openstack-helm, openstack-helm-infra, and openstack-helm-addons
id: Ubah urutan kunci di semua chart di openstack-helm, openstack-helm-infra, dan openstack-helm-addons

source: Charts for all core OpenStack services must be present to achieve 1.0 releasability. The only core service outstanding at this time is Swift.
id: Chart untuk semua layanan OpenStack inti harus ada untuk mencapai 1.0 releasability. Satu-satunya layanan inti yang beredar saat ini adalah Swift.

source: Charts for exporters: kube-state-metrics, ceph-exporter, openstack-exporter?
id: Chart untuk eksportir: kube-state-metrics, ceph-exporter, openstack-exporter?

source: Code Completion and Refactoring
id: Code Completion dan Refactoring

source: Collect logs from the node by Fluentbit
id: Kumpulkan log dari node dengan Fluentbit

source: Common method to configure all monitoring targets
id: Metode umum untuk mengonfigurasi semua target pemantauan

source: Comprehensive documentation is key to the ability for real-world operators to benefit from OpenStack-Helm, and so it is a requirement for 1.0 releasability. The following outstanding items must be completed from a documentation perspective:
id: Dokumentasi yang komprehensif adalah kunci kemampuan operator real-world untuk mendapatkan manfaat dari OpenStack-Helm, dan karenanya merupakan persyaratan untuk 1.0 releasability. Barang luar biasa (outstanding) berikut harus diselesaikan dari perspektif dokumentasi:

source: Configurable log rotation mechanism
id: Mekanisme rotasi log yang dapat dikonfigurasi

source: Configuration in :code:`neutron.conf` and :code:`ml2_conf.ini`
id: Konfigurasi dalam :code:`neutron.conf` and :code:`ml2_conf.ini`

source: Cover the following logging use cases https://review.openstack.org/#/c/482687/
id: Cover kasus penggunaan logging berikut https://review.openstack.org/#/c/482687/

source: Create SSH Key in nova
id: Buat SSH Key di nova

source: Create VM on tenant network
id: Buat VM di jaringan tenant

source: Create conditionals in the helm charts. This is problematic, as the amount of conditionals will increase and will be harder to maintain. Overrides files are easy to sync between charts.
id: Buat persyaratan di helm chart. Ini bermasalah, karena jumlah persyaratan akan meningkat dan akan lebih sulit untuk dipertahankan. File yang di-overrided mudah disinkronkan di antara chart.

source: Create external network
id: Buat jaringan eksternal

source: Create tenant network
id: Buat jaringan penyewa (tenant)

source: Create tenant router to link tenant network and external
id: Buat router tenant untuk menghubungkan jaringan tenant dan eksternal

source: Currently OpenStack-Helm supports OpenVSwitch as a network virtualization engine. In order to support many possible backends (SDNs), changes are required in neutron chart and in deployment techniques. OpenStack-Helm can support every SDN solution that has Neutron plugin, either core_plugin or mechanism_driver.
id: Saat ini OpenStack-Helm mendukung OpenVSwitch sebagai mesin virtualisasi jaringan. Untuk mendukung banyak kemungkinan backend (SDNs), perubahan diperlukan dalam chart neutron dan teknik penyebaran. OpenStack-Helm dapat mendukung setiap solusi SDN yang memiliki plugin Neutron, baik core_plugin atau mechanism_driver

source: Currently both OpenStack-Helm and OpenStack-Helm-Infra have their own parallel versions of the Helm-Toolkit library chart. They must be combined into a single chart in OpenStack-Helm-Infra prior to 1.0.
id: Saat ini baik OpenStack-Helm dan OpenStack-Helm-Infra memiliki versi paralel mereka sendiri dari chart pustaka Helm-Toolkit. Mereka harus digabungkan menjadi satu chart tunggal di OpenStack-Helm-Infra sebelum 1.0.

source: DHCP - auto-assign IP address and DNS info
id: DHCP - auto-assign IP address dan DNS info

source: Deploy Kubernetes via KubeADM, with charts for CNI and DNS services
id: Menyebarkan Kubernet melalui KubeADM, dengan grafik untuk layanan CNI dan DNS

source: Deploying multuple Ceph clusters
id: Menyebarkan multiple cluster Ceph

source: Develop scripts for bringing up OpenStack-Helm Charts and perform basic interactive tests
id: Kembangkan skrip untuk memunculkan OpenStack-Helm Charts dan melakukan tes interaktif dasar

source: Developer Environment
id: Lingkungan Pengembang

source: Developers require a simple way of instantiating a working environment for OpenStack-Helm, that allows them to quickly begin development of the project. This is more complex to achieve than many OpenStack Projects that can simply rely upon a devstack plugin to achieve this. This is as OpenStack-Helm is focused on the deployment of OpenStack (and associated) Projects, rather than the development of the projects themselves, and also requires additional supporting infrastructure, e.g. Kubernetes and a CNI.
id: Pengembang membutuhkan cara sederhana untuk membuat contoh lingkungan kerja OpenStack-Helm, yang memungkinkan mereka untuk dengan cepat memulai pengembangan proyek. Ini lebih kompleks untuk dicapai daripada banyak OpenStack Project yang hanya dapat mengandalkan plugin devstack untuk mencapai ini. Ini karena OpenStack-Helm berfokus pada penyebaran OpenStack Project (dan yang terkait), daripada pengembangan proyek itu sendiri, dan juga membutuhkan infrastruktur pendukung tambahan, misal Kubernetes dan CNI.

source: Development of OpenStack-Helm
id: Perkembangan OpenStack-Helm

source: Documentation
id: Dokumentasi

source: Documentation Impact
id: Dampak Dokumentasi

source: Documentation of how new SDN can be enabled, how Neutron should be configured. Also, for each new SDN that would be incorporated, the architecture overview should be provided.
id: Dokumentasi tentang bagaimana SDN baru dapat diaktifkan, bagaimana Neutron harus dikonfigurasi. Juga, untuk setiap SDN baru yang akan dimasukkan, tinjauan arsitektur harus disediakan.

source: Documentation of how to enable the registry secret generation
id: Dokumentasi cara mengaktifkan pembuatan rahasia registri
