Repository: zhen00fa/helm-openstack
Catalog: openstack-helm/doc/source/locale/*/LC_MESSAGES/doc-specs.po
Languages: id

source: Log aggregator deployment runs on a selected node as deployment
id: Penerapan agregator log berjalan pada node yang dipilih sebagai penyebaran

source: Log aggregator is able to send data to Elasticsearch and Kafka
id: Log aggregator dapat mengirim data ke Elasticsearch dan Kafka

source: Log aggregator should be scalable
id: Log agregator harus scalable

source: Log aggregator should have HA capability
id: Log aggregator harus memiliki kemampuan HA

source: Log aggregator should have a flexible output capability to choose from
id: Log aggregator harus memiliki kemampuan output yang fleksibel untuk dipilih

source: Log collection daemon runs on each node to forward logs to aggregator
id: Log koleksi daemon berjalan pada setiap node untuk meneruskan log ke aggregator

source: Log collection daemon runs on each node to forward logs to storage
id: Log koleksi daemon berjalan pada setiap node untuk meneruskan log ke penyimpanan

source: Log collection daemon should have a minimal server footprint
id: Daemon pengumpulan log harus memiliki jejak server minimal

source: Logging Requirements
id: Persyaratan Logging

source: Logging Use Cases
id: Mencatat Penggunaan Kasus (logging use case)

source: Logical Diagram
id: Diagram Logika

source: Make following changes to script: 1 Replace occurrence of ``ceph-fs-uuid.txt`` with ``tenant-ceph-fs-uuid.txt``
id: Buat perubahan berikut pada skrip: 1 Ganti kemunculan ``ceph-fs-uuid.txt`` dengan ``tenant-ceph-fs-uuid.txt``

source: Make webserver binary path/arguments templated using ``values.yaml``. As expressed above, this allows us to provide different overrides per image/distribution to automatically wire things.
id: Buat path/argument biner webserver templated menggunakan ``values.yaml``. Seperti yang dinyatakan di atas, ini memungkinkan kami untuk memberikan penggantian yang berbeda per image/distribution untuk secara otomatis mentransfer berbagai hal.

source: Metadata- Provide proxy for Nova metadata service
id: Metadata- Berikan proxy untuk layanan Nova metadata

source: Monitoring
id: Pemantauan

source: Monitoring Requirements
id: Persyaratan Pemantauan

source: Monitoring Use Cases
id: Memonitor Kasus Penggunaan

source: More information about the blueprint + specification lifecycle can be found here_.
id: Informasi lebih lanjut tentang siklus hidup blueprint + spesifikasi dapat ditemukan here_.

source: Multi-OS Support
id: Dukungan Multi-OS

source: Next, Neutron services like L3 routing, DHCP and metadata serving should be considered. If SDN provides its own implementation, the Neutron's default one should be disabled:
id: Selanjutnya, layanan Neutron seperti L3 routing, DHCP dan penyajian metadata harus dipertimbangkan. Jika SDN menyediakan implementasinya sendiri, default Neutron harus dinonaktifkan:

source: No benchmark was done to evaluate:
id: Tidak ada patokan yang dilakukan untuk mengevaluasi:

source: No change in testing is required, *per se*. It is expected the new software configuration would be tested with the current practices.
id: Tidak diperlukan perubahan dalam pengujian, *per se*. Diharapkan konfigurasi perangkat lunak baru akan diuji dengan praktik saat ini.

source: No direct impact, as there is no change in the current software/configuration location, merely a templating change.
id: Tidak ada dampak langsung, karena tidak ada perubahan pada lokasi software/configuration saat ini, hanya perubahan templating.

source: No impact
id: Tidak ada dampak

source: No performance impact
id: Tidak ada dampak kinerja

source: No security impact.
id: Tidak ada dampak keamanan.

source: None more than this spec, as it should be relatively transparent for the user. However, extra documentation to explain the usage of ``value_overrides`` would be welcomed.
id: Tidak lebih dari spesifikasi ini, karena seharusnya relatif transparan untuk pengguna. Namun, dokumentasi tambahan untuk menjelaskan penggunaan ``value_overrides`` akan disambut.

source: Not providing a support of multiple images. This leads to ease of maintainance and reduced gate impact, with the risk of having less contributors. For available overrides, users would have to provide many overrides themselves, while this spec proposes a common community approach.
id: Tidak memberikan dukungan multiple image. Ini mengarah pada kemudahan pemeliharaan dan mengurangi dampak gate, dengan risiko memiliki lebih sedikit kontributor. Untuk override yang tersedia, pengguna harus menyediakan sendiri banyak override, sementara spesifikasi ini mengusulkan pendekatan komunitas umum.

source: Note that mon_addr and mon_host have default mon port 6789.
id: Perhatikan bahwa mon_addr dan mon_host memiliki mon port default 6789.

source: OSH Logging, Monitoring, and Alerting
id: OSH Logging, Monitoring, dan Alerting

source: OVS is an alternative in Neutron reference architecture. It is already in tree.
id: OVS adalah alternatif dalam arsitektur referensi Neutron. Sudah ada di tree.

source: On top of that, the newly provided `example_values/` must aim for being tested **as soon as possible upon delivery**. Without tests, those examples will decrepit. The changes in CI pipelines for making use of `example_values` is outside the scope of this spec.
id: Selain itu, `example_values/` yang baru disediakan harus bertujuan untuk diuji ***as soon as possible upon delivery**. Tanpa tes, contoh itu akan usang. Perubahan dalam pipeline CI untuk menggunakan `example_values` berada di luar cakupan spec ini.

source: Only provide one way to configure software, and expect to always have the same versions. This is further away from the "image independent" contract, with extra burden: We will need to maintain a curated list of versions, deal with the differences of the defaults (selinux/apparmor profiles come to mind as path sensitive for example), and different expectations for operational teams ("The code is not where I expect it to be in the image"). Embracing difference could even allow deployers to have different expectations for images, for example: apache+mod_wsgi vs uwsgi standalone or uwsgi + nginx.
id: Hanya menyediakan satu cara untuk mengkonfigurasi perangkat lunak, dan berharap untuk selalu memiliki versi yang sama. Ini lebih jauh dari kontrak "image independent", dengan beban tambahan: Kita perlu mempertahankan daftar versi yang dikuratori (curated), menangani perbedaan default (profil selinux/apparmor muncul di pikiran sebagai path sensitif misalnya), dan harapan yang berbeda untuk tim operasional ("The code is not where I expect it to be in the image"). Merangkul perbedaan bahkan dapat memungkinkan para deployer untuk memiliki harapan yang berbeda untuk image, misalnya: apache+mod_wsgi vs uwsgi standalone or uwsgi + nginx.

source: OpenStack metrics: tenants, networks, flavors, floating IPs, quotas, etc
id: Metrik OpenStack: tenants, networks, flavors, floating IPs, quotas, dll

source: OpenStack-Helm currently lacks a centralized mechanism for providing insight into the performance of the OpenStack services and infrastructure components. The log formats of the different components in OpenStack-Helm vary, which makes identifying causes for issues difficult across services. To support operational readiness by default, OpenStack-Helm should include components for logging events in a common format, monitoring metrics at all levels, alerting and alarms for those metrics, and visualization tools for querying the logs and metrics in a single pane view.
id: OpenStack-Helm saat ini tidak memiliki mekanisme terpusat untuk memberikan wawasan tentang kinerja layanan OpenStack dan komponen infrastruktur. Format log dari berbagai komponen di OpenStack-Helm bervariasi, yang membuat mengidentifikasi penyebab masalah sulit di seluruh layanan. Untuk mendukung kesiapan operasional secara default, OpenStack-Helm harus menyertakan komponen untuk mencatat peristiwa dalam format umum, memantau metrik di semua tingkatan, mengingatkan dan alarm untuk metrik tersebut, dan alat visualisasi untuk menanyakan log dan metrik dalam tampilan panel tunggal.

source: OpenStack-Helm defines a centralized logging mechanism to provide insight into the state of the OpenStack services and infrastructure components as well as underlying Kubernetes platform. Among the requirements for a logging platform, where log data can come from and where log data need to be delivered are very variable. To support various logging scenarios, OpenStack-Helm should provide a flexible mechanism to meet with certain operation needs. This spec proposes fast and lightweight log forwarder and full featured log aggregator complementing each other providing a flexible and reliable solution. Especially, Fluentbit is proposed as a log forwarder and Fluentd is proposed as a main log aggregator and processor.
id: OpenStack-Helm mendefinisikan mekanisme logging terpusat untuk memberikan wawasan (insight) tentang status layanan OpenStack dan komponen infrastruktur serta platform Kubernetes yang mendasarinya. Di antara persyaratan untuk platform logging, dari mana data log dapat berasal dan dari mana data log harus dikirim sangat bervariasi. Untuk mendukung berbagai skenario logging, OpenStack-Helm harus menyediakan mekanisme yang fleksibel untuk memenuhi kebutuhan operasi tertentu. Spesifikasi ini mengusulkan log forwarder cepat dan ringan dan agregator log berfitur lengkap yang saling melengkapi memberikan solusi yang fleksibel dan andal. Terutama, Fluentbit diusulkan sebagai log forwarder dan Fluentd diusulkan sebagai agregator dan prosesor log utama.

source: OpenStack-Helm documentation will be updated to indicate the usage of the nginx sidecar.
id: Dokumentasi OpenStack-Helm akan diperbarui untuk menunjukkan penggunaan nginx sidecar.

source: OpenStack-Helm for OpenStack services
id: OpenStack-Helm untuk layanan OpenStack

source: OpenStack-Helm has developed a number of conventions around the format and ordering of charts' `values.yaml` file, in support of both reusable Helm-Toolkit functions and ease of developer ramp-up. For 1.0 readiness, OpenStack-Helm must cement these conventions within a spec, as well as the ordering of `values.yaml` keys. These conventions must then be gated to guarantee conformity. The spec in progress can be found here [1]_.
id: OpenStack-Helm telah mengembangkan sejumlah konvensi seputar format dan pemesanan file chart ``values.yaml`, untuk mendukung kedua fungsi Helm-Toolkit yang dapat digunakan kembali dan kemudahan pengembangan pengembang. Untuk kesiapan 1.0, OpenStack-Helm harus menambahkan konvensi ini dalam spesifikasi, serta urutan kunci `values.yaml`. Konvensi ini kemudian harus terjaga keamanannya untuk menjamin kepatuhan. Spesifikasi yang sedang berjalan dapat ditemukan di sini [1] _.

source: OpenStack-Helm has undergone rapid development and maturation over its lifetime, and is nearing the point of real-world readiness. This spec details the functionality that must be implemented in OpenStack-Helm for it to be considered ready for a 1.0 release, as well as for general use.
id: OpenStack-Helm telah mengalami perkembangan dan pematangan yang cepat selama masa hidupnya, dan mendekati titik kesiapan real-world. Spesifikasi ini merinci fungsionalitas yang harus diimplementasikan di OpenStack-Helm agar dianggap siap untuk rilis 1.0, serta untuk penggunaan umum.

source: OpenStack-Helm multinode guide includes scripts which are used to specify overrides and deploy charts.
id: Panduan multinode OpenStack-Helm mencakup skrip yang digunakan untuk menentukan override dan menyebarkan chart.

source: OpenStack-Helm supports a "bring your own Kubernetes" paradigm. Any particular k8s configuration or feature requirements must be documented.
id: OpenStack-Helm mendukung paradigma "bring your own Kubernetes". Konfigurasi k8 tertentu atau persyaratan fitur harus didokumentasikan.

source: OpenStack-Helm-Addons for ancillary services
id: OpenStack-Helm-Addons untuk layanan tambahan

source: OpenStack-Helm-Infra for supporting services
id: OpenStack-Helm-Infra untuk layanan pendukung

source: Operators should be able to use Openstack-Helm to deploy containerized openstack services with a docker registry has authentication turned on.
id: Operator harus dapat menggunakan Openstack-Helm untuk menggunakan layanan openstack containerized dengan registry docker yang telah mengaktifkan otentikasi.

source: Organizational auditing needs
id: Kebutuhan audit organisasi

source: Other networking services provided by Neutron are:
id: Layanan jaringan lain yang disediakan oleh Neutron adalah:

source: Other services inside Neutron reference stack (L3/DHCP/metadata agents) are dependent on L2 connectivity agent. Thus, replacing OVS with LB would cause changes in mentioned services configuration.
id: Layanan lain di dalam stack referensi Neutron (L3/DHCP/metadata agents) bergantung pada agen konektivitas L2. Jadi, mengganti OVS dengan LB akan menyebabkan perubahan dalam konfigurasi layanan yang disebutkan.

source: Our :ref:`images documentation` documentation claims to be independent of the image. However, some helm charts hard code paths of binaries, executables' runtime configurations, etc. Therefore, the image agnostic promise is broken.
id: Dokumentasi kami :ref:`images documentation` mengklaim tidak tergantung dari image. Namun, beberapa helm menunjukkan jalur kode yang sulit dari binari, konfigurasi runtime yang dapat dieksekusi, dll. Oleh karena itu, janji agnostik image rusak.

source: Performance Impact
id: Dampak Kinerja

source: Platform Requirements
id: Persyaratan Platform

source: PoC deployments of OpenStack-Helm
id: Deployment PoC dari OpenStack-Helm

source: Port numbers for Ceph_Mon and Ceph_Mgr are different from default.
id: Nomor port untuk Ceph_Mon dan Ceph_Mgr berbeda dari default.

source: Pre-pulling images on all nodes
id: Pre-pulling image di semua node

source: Prepare Host(s) for OpenStack-Helm deployment
id: Mempersiapkan Host untuk penerapan OpenStack-Helm

source: Primary assignee:
id: Penugasan utama (primary assignee):

source: Primary assignees:
id: Penerima tugas utama (primary assignees):

source: Proactive monitoring of stack traces across all deployed infrastructure
id: Pemantauan proaktif stack trace di semua infrastruktur yang digunakan

source: Problem Description
id: Deskripsi Masalah

source: Process and Tooling
id: Proses dan Tooling

source: Project Specifications
id: Spesifikasi Proyek

source: Prometheus and Grafana meet OpenStack-Helm's monitoring requirements. The Prometheus monitoring tool provides the ability to scrape targets for metrics over HTTP, and it stores these metrics in Prometheus's time-series database. The monitoring targets can be discovered via static configuration in Prometheus or through service discovery. Prometheus includes a querying language that provides meaningful queries against the metrics gathered and supports the creation of rules to measure these metrics against for alerting purposes. It also supports a wide range of Prometheus exporters for existing services, including Ceph and OpenStack. Grafana supports Prometheus as a data source, and provides the ability to view the metrics gathered by Prometheus in a single pane dashboard. Grafana can be bootstrapped with dashboards for each target scraped, or the dashboards can be added via Grafana's web interface directly. To meet OpenStack-Helm's alerting needs, Alertmanager can be used to interface with Prometheus and send alerts based on Prometheus rule evaluations.
id: Prometheus dan Grafana memenuhi persyaratan pemantauan OpenStack-Helm. Alat pemantauan Prometheus menyediakan kemampuan untuk mengikis target (scrape target) untuk metrik melalui HTTP, dan alat ini menyimpan metrik ini dalam basis data seri waktu Prometheus. Sasaran pemantauan dapat ditemukan melalui konfigurasi statis di Prometheus atau melalui penemuan layanan. Prometheus menyertakan bahasa kueri yang menyediakan kueri yang berarti terhadap metrik yang dikumpulkan dan mendukung pembuatan aturan untuk mengukur metrik ini untuk keperluan peringatan. Ini juga mendukung berbagai eksportir Prometheus untuk layanan yang ada, termasuk Ceph dan OpenStack. Grafana mendukung Prometheus sebagai sumber data, dan menyediakan kemampuan untuk melihat metrik yang dikumpulkan oleh Prometheus dalam dasbor panel tunggal. Grafana dapat di-bootstrap dengan dasbor untuk setiap target yang dikorek, atau dasbor dapat ditambahkan melalui antarmuka web Grafana secara langsung. Untuk memenuhi kebutuhan peringatan OpenStack-Helm, Alertmanager dapat digunakan untuk berinteraksi dengan Prometheus dan mengirim peringatan berdasarkan evaluasi aturan Prometheus.

source: Proper directories mounted to retrieve logs from the node
id: Direktori yang tepat dipasang untuk mengambil log dari node

source: Proposed Change
id: Usulan Perubahan

source: Proposes a common approach to software configuration, describing the distro/image specific differences for applications.
id: Mengusulkan pendekatan umum untuk konfigurasi perangkat lunak, menjelaskan perbedaan specific distro/image untuk aplikasi.

source: Provide the credentials and add the manifest across all charts in OSH and OSH-infra
id: Berikan kredensial dan tambahkan manifes di semua chart di OSH dan OSH-infra

source: Providing the neutron plugin code.
id: Memberikan kode plugin neutron.

source: Provision of those services should be included inside SDN chart.
id: Penyediaan layanan tersebut harus dimasukkan dalam chart SDN.

source: Put .docker/config.json in docker/kubelet root directory on all nodes
id: Masukkan .docker/config.json di direktori root docker/kubelet di semua node

source: Record OpenStack service behavior and status
id: Catat perilaku dan status layanan OpenStack

source: Record compute instance behavior across nodes and services
id: Catat perilaku instance komputasi di seluruh node dan layanan

source: Reference the created secret by adding the ``imagePullSecrets:`` field to ServiceAccount resource template [2]_ in ``helm-toolkit/snippets/_kubernetes_pod_rbac_serviceaccount.tpl``. To handle it as optional, the field is wrapped in a conditional. For example,
id: Referensi rahasia yang dibuat dengan menambahkan field ``imagePullSecrets:`` ke templat sumber daya ServiceAccount [2] _ dalam ``helm-toolkit/snippets/_kubernetes_pod_rbac_serviceaccount.tpl``. Untuk menanganinya sebagai opsional, field dikemas dalam kondisi. Sebagai contoh,

source: References
id: Referensi

source: Release notes for the 1.0 release must be prepared, following OpenStack best practices. The criteria for future changes that should be included in release notes in an ongoing fashion must be defined / documented as well.
id: Catatan rilis untuk rilis 1.0 harus disiapkan, mengikuti praktik terbaik OpenStack. Kriteria untuk perubahan di masa depan yang harus dimasukkan dalam catatan rilis dengan cara yang berkelanjutan harus didefinisikan / didokumentasikan juga.

source: Releated Specs: 1. OSH logging monitoring and alerting: https://review.openstack.org/#/c/482687/
id: Spesifikasi yang Diresmikan: 1. Pemantauan dan peringatan logging OSH: https://review.openstack.org/#/c/482687/

source: Result from Steps 2, 3, 4:
id: Hasil dari Langkah 2, 3, 4:

source: Results from Step 5, 6, 7:
id: Hasil dari Langkah 5, 6, 7:

source: SSH into VM and check it can access the internet
id: SSH ke VM dan periksa apakah dapat mengakses internet

source: Sane defaults for log retention and rotation policies
id: Sane default untuk penyimpanan retensi dan kebijakan rotasi

source: Script to update and execute: ``020-ingress.sh``
id: Skrip untuk update dan menjalankan: ``020-ingress.sh``

source: Script to update and execute: ``030-ceph.sh``
id: Skrip untuk update dan menjalankan: ``030-ceph.sh``

source: Script to update and execute: ``030-tenant-ceph.sh``
id: Skrip untuk update dan menjalankan: ``030-tenant-ceph.sh``

source: Script to update and execute: ``040-tenant-ceph-ns-activate.sh``
id: Skrip untuk update dan menjalankan: ``040-tenant-ceph-ns-activate.sh``

source: Script to update and execute: ``100-glance.sh``
id: Skrip untuk update dan menjalankan: ``100-glance.sh``

source: Script to update and execute: ``110-cinder.sh``
id: Skrip untuk update dan menjalankan: ``110-cinder.sh``

source: Script to update: ``090-tenant-ceph-radosgateway.sh``
id: Skrip untuk update: ``090-tenant-ceph-radosgateway.sh``

source: Security Impact
id: Dampak Keamanan

source: See above for documentation requirements.
id: Lihat di atas untuk persyaratan dokumentasi.

source: See above for gating requirements.
id: Lihat di atas untuk persyaratan gating.

source: See above for the list of work items.
id: Lihat di atas untuk daftar item pekerjaan.

source: Setup access to the external network from the development machine
id: Atur akses ke jaringan eksternal dari mesin pengembangan

source: Single pane visualization capabilities
id: Kemampuan visualisasi panel tunggal

source: Specifications Process
id: Spesifikasi Proses

source: Specifications Purpose
id: Specifications Purpose (spesifikasi tujuan)

source: Specifications in this repository represent a consensus on the topics covered within. They should be considered a mandate on the path forward with regards to the content on which they are drafted.
id: Spesifikasi dalam repositori ini mewakili konsensus tentang topik yang dicakup di dalam. Mereka harus dianggap sebagai mandat di jalan ke depan sehubungan dengan konten yang mereka buat.

source: Support OCI image registry with authentication turned on
id: Mendukung OCI image registry dengan otentikasi dihidupkan

source: Support linux bridge on neutron helm chart
id: Mendukung linux bridge pada chart helm neutron

source: TODO - release management spec
id: TODO - rilis spesifikasi manajemen

source: Test Steps:
id: Langkah uji:

source: Testing
id: Pengujian

source: Testing should include Helm tests for each of the included charts as well as an integration test in the gate.
id: Pengujian harus mencakup tes Helm untuk masing-masing chart termasuk juga tes integrasi di gate.

source: The LinuxBridge (LB) is Neutron's L2 agent, using linux kernel bridges as network configuration for VMs. Both OVS and LB are part of Neutron's Modular Layer 2 (ML2) framework, allowing to simultaneously utilize the variety of layer 2 networking technologies.
id: LinuxBridge (LB) adalah agen L2 Neutron, menggunakan jembatan kernel Linux sebagai konfigurasi jaringan untuk VM. Baik OVS dan LB adalah bagian dari kerangka kerja Modular Layer 2 (ML2) Neutron, memungkinkan untuk secara bersamaan memanfaatkan berbagai teknologi jaringan layer 2.

source: The Neutron reference architecture provides mechanism_drivers OpenVSwitch (OVS) and linuxbridge (LB) with ML2 core_plugin framework.
id: Arsitektur referensi Neutron menyediakan mechanism_drivers OpenVSwitch (OVS) dan linuxbridge (LB) dengan ML2 core_plugin framework.

source: The OpenStack-Helm Zuulv2 gates were written to allow use outside of OpenStack-Infra, to quickly set up a Kubernetes cluster, with the adoption of Zuulv3 underway it is logical to extend this paradigm to the Zuulv3 Playbooks. This will be driven via a ``Makefile`` that will allow developers to perform the following actions:
id: Gate OpenStack-Helm Zuulv2 ditulis untuk memungkinkan penggunaan di luar OpenStack-Infra, untuk dengan cepat membuat kluster Kubernetes, dengan adopsi Zuulv3 yang sedang berjalan, logis untuk memperluas paradigma ini ke Playbook Zuulv3. Ini akan didorong melalui ``Makefile`` yang akan memungkinkan pengembang untuk melakukan tindakan berikut:
