Repository: zhen00fa/helm-openstack
Catalog: openstack-helm/doc/source/locale/*/LC_MESSAGES/doc-install.po
Languages: de

source: **Check Chart Status**
de: **Chart Status überprüfen**

source: **First**, edit the ``values.yaml`` for Neutron, Glance, Horizon, Keystone, and Nova.
de: **Zuerst**, editieren Sie die ``values.yaml`` für Neutron, Glance, Horizon, Keystone und Nova.

source: **Review the Ingress configuration.**
de: **Überprüfen Sie die Ingress-Konfiguration.**

source: **Second** option would be as ``--set`` flags when calling ``helm install``
de: **Zweiten** Option wäre als ``set`` Flags beim Aufruf von` `helm install``

source: 16GB of RAM
de: 16 GB RAM

source: 4 Cores
de: 4 Kerne

source: 8 Cores
de: 8 Kerne

source: 8GB of RAM
de: 8 GB RAM

source: Activate the OpenStack namespace to be able to use Ceph
de: Aktivieren Sie den OpenStack-Namespace, um Ceph verwenden zu können

source: Activate the openstack namespace to be able to use Ceph
de: Aktivieren Sie den Openstack-Namespace, um Ceph verwenden zu können

source: Add the address of the Kubernetes API, ``172.17.0.1``, and ``.svc.cluster.local`` to your ``no_proxy`` and ``NO_PROXY`` environment variables.
de: Fügen Sie die Adresse der Kubernetes-API ``172.17.0.1`` und ``.svc.cluster.local`` zu Ihren Umgebungsvariablen ``no_proxy`` und ``NO_PROXY`` hinzu.

source: Add to the Install steps these flags - also adding a shell environment variable to save on repeat code.
de: Fügen Sie zu den Installationsschritten diese Flags hinzu, und fügen Sie außerdem eine Shell-Umgebungsvariable hinzu, um den Wiederholungscode zu speichern.

source: Additional configuration variables can be found `here <https://github.com/openstack/openstack-helm-infra/blob/master/roles/deploy-kubeadm-aio-common/defaults/main.yml>`_. In particular, ``kubernetes_cluster_pod_subnet`` can be used to override the pod subnet set up by Calico (the default container SDN), if you have a preexisting network that conflicts with the default pod subnet of 192.168.0.0/16.
de: Zusätzliche Konfigurationsvariablen finden Sie `hier <https://github.com/openstack/openstack-helm-infra/blob/master/roles/deploy-kubeadm-aio-common/defaults/main.yml>`_. Insbesondere kann ``kubernetes_cluster_pod_subnet`` verwendet werden, um das von Calico (dem Standard-Container SDN) eingerichtete Pod-Subnetz zu überschreiben, wenn ein bereits bestehendes Netzwerk mit dem Standard-Pod-Subnetz von 192.168.0.0/16 in Konflikt steht.

source: Additional information on Kubernetes Ceph-based integration can be found in the documentation for the `CephFS <https://github.com/kubernetes-incubator/external-storage/blob/master/ceph/cephfs/README.md>`_ and `RBD <https://github.com/kubernetes-incubator/external-storage/blob/master/ceph/rbd/README.md>`_ storage provisioners, as well as for the alternative `NFS <https://github.com/kubernetes-incubator/external-storage/blob/master/nfs/README.md>`_ provisioner.
de: Weitere Informationen zur Kubernetes Ceph-basierten Integration finden Sie in der Dokumentation zum `CephFS <https://github.com/kubernetes-incubator/external-storage/blob/master/ceph/cephfs/README.md>`_ und` RBD <https://github.com/kubernetes-incubator/external-storage/blob/master/ceph/rbd/README.md>`_ Speicher-Provisioner, sowie für die Alternative `NFS <https://github.com/kubernetes-incubator/external-storage/blob/master/nfs/README.md>`_ Bereitsteller.

source: After making the configuration changes, run a ``make`` and then install as you would from AIO or MultiNode instructions.
de: Nachdem Sie die Konfigurationsänderungen vorgenommen haben, führen Sie ein ``make`` aus und installieren Sie dann wie von AIO- oder MultiNode-Anweisungen.

source: All commands below should be run as a normal user, not as root. Appropriate versions of Docker, Kubernetes, and Helm will be installed by the playbooks used below, so there's no need to install them ahead of time.
de: Alle folgenden Befehle sollten als normaler Benutzer und nicht als root ausgeführt werden. Entsprechende Versionen von Docker, Kubernetes und Helm werden von den unten verwendeten Playbooks installiert, so dass es nicht notwendig ist, sie vorher zu installieren.

source: Alternatively, this step can be performed by running the script directly:
de: Alternativ kann dieser Schritt ausgeführt werden, indem das Skript direkt ausgeführt wird:

source: An Ingress is a collection of rules that allow inbound connections to reach the cluster services.
de: Ein Ingress ist eine Sammlung von Regeln, die es eingehenden Verbindungen erlauben, die Cluster-Dienste zu erreichen.

source: Below are some instructions and suggestions to help you get started with a Kubeadm All-in-One environment on Ubuntu 16.04. Other supported versions of Linux can also be used, with the appropriate changes to package installation.
de: Im Folgenden finden Sie einige Anweisungen und Vorschläge, die Ihnen den Einstieg in eine Kubeadm All-in-One-Umgebung unter Ubuntu 16.04 erleichtern. Andere unterstützte Linux-Versionen können ebenfalls mit den entsprechenden Änderungen an der Paketinstallation verwendet werden.

source: By default the Calico CNI will use ``192.168.0.0/16`` and Kubernetes services will use ``10.96.0.0/16`` as the CIDR for services. Check that these CIDRs are not in use on the development node before proceeding, or adjust as required.
de: Standardmäßig verwendet der Calico CNI `192.168.0.0/16`` und Kubernetes Dienste` `10.96.0.0/16`` als CIDR für Dienste. Stellen Sie sicher, dass diese CIDRs nicht auf dem Entwicklungsknoten verwendet werden, bevor Sie fortfahren, oder passen Sie sie wie erforderlich an.

source: Cinder deployment is not tested in the OSH development environment community gates
de: Die Cinder-Bereitstellung wird nicht in den Community-Gates der OSH-Entwicklungsumgebung getestet

source: Cleaning the Deployment
de: Reinigung der Bereitstellung

source: Clone the OpenStack-Helm Repos
de: Klonen Sie die OpenStack-Helm Repos

source: Code examples below.
de: Codebeispiele unten.

source: Common Deployment Requirements
de: Allgemeine Bereitstellungsanforderungen

source: Configure OpenStack
de: Konfigurieren Sie OpenStack

source: Configuring OpenStack for a particular production use-case is beyond the scope of this guide. Please refer to the OpenStack `Configuration <https://docs.openstack.org/latest/configuration/>`_ documentation for your selected version of OpenStack to determine what additional values overrides should be provided to the OpenStack-Helm charts to ensure appropriate networking, security, etc. is in place.
de: Die Konfiguration von OpenStack für einen bestimmten Produktions-Anwendungsfall würde den Rahmen dieses Handbuchs sprengen. Bitte beachten Sie die OpenStack `Konfiguration <https://docs.openstack.org/latest/configuration/>`_ Dokumentation für Ihre Version von OpenStack, um zu ermitteln, welche zusätzlichen Werte den OpenStack-Helm-Charts hinzugefügt werden sollten, um eine angemessene Vernetzung, Sicherheit usw. sicherzustellen.

source: Contents:
de: Inhalt:

source: Copy the key: ``sudo cp ~/.ssh/id_rsa /etc/openstack-helm/deploy-key.pem``
de: Kopieren Sie den Schlüssel: ``sudo cp ~/.ssh/id_rsa /etc/openstack-helm/deploy-key.pem``

source: Create an environment file
de: Erstellen Sie eine Umgebungsdatei

source: Create an inventory file
de: Erstellen Sie eine Inventardatei

source: Create an ssh-key on the master node, and add the public key to each node that you intend to join the cluster.
de: Erstellen Sie auf dem Master-Knoten einen SSH-Schlüssel, und fügen Sie jedem Knoten, dem Sie den Cluster beitreten möchten, den öffentlichen Schlüssel hinzu.

source: Deploy Barbican
de: Bereitstellen von Barbican

source: Deploy Ceph
de: Stellen Sie Ceph bereit

source: Deploy Cinder
de: Bereitstellen von Cinder

source: Deploy Compute Kit (Nova and Neutron)
de: Bereitstellen eines Compute Kit (Nova und Neutron)

source: Deploy Glance
de: Bereitstellen von Glance

source: Deploy Heat
de: Bereitstellen von Heat

source: Deploy Horizon
de: Bereitstellen von Horizont

source: Deploy Keystone
de: Stellen Sie Keystone bereit

source: Deploy Kubernetes & Helm
de: Stellen Sie Kubernetes & Helm bereit

source: Deploy Libvirt
de: Stellen Sie Libvirt bereit

source: Deploy MariaDB
de: Stellen Sie MariaDB bereit

source: Deploy Memcached
de: Bereitstellen von Memcached

source: Deploy NFS Provisioner
de: Bereitstellen von NFS-Provisioner

source: Deploy OpenStack-Helm
de: Stellen Sie OpenStack-Helm bereit

source: Deploy OpenvSwitch
de: Stellen Sie OpenvSwitch bereit

source: Deploy RabbitMQ
de: Stellen Sie RabbitMQ bereit

source: Deploy Rados Gateway for object store
de: Stellen Sie Rados Gateway für den Objektspeicher bereit

source: Deploy the ingress controller
de: Stellen Sie den Ingress-Controller bereit

source: Deployment With Ceph
de: Einsatz mit Ceph

source: Deployment With NFS
de: Bereitstellung mit NFS

source: Development
de: Entwicklung

source: Environment tear-down
de: Environment-Abbau

source: Essentially the use of Ingress for OpenStack-Helm is an Nginx proxy service. Ingress (Nginx) is accessible by your cluster public IP - e.g. the IP associated with ``kubectl get pods -o wide --all-namespaces | grep ingress-api`` Ingress/Nginx will be listening for server name requests of "keystone" or "keystone.openstack" and will route those requests to the proper internal K8s Services. These public listeners in Ingress must match the external DNS that you will set up to access your OpenStack deployment. Note each rule also has a Service that directs Ingress Controllers allow access to the endpoints from within the cluster.
de: Im Wesentlichen ist die Verwendung von Ingress für OpenStack-Helm ein Nginx-Proxy-Dienst. Auf Ingress (Nginx) kann über die öffentliche IP-Adresse des Clusters zugegriffen werden - z.B. die mit ``kubectl get pods -o wide --all-namespaces |`` verbundene IP grep ingress-api`` Ingress / Nginx wird auf die Server-Namensanforderungen ``keystone`` oder ``keystone.openstack`` warten und diese Anfragen an die richtigen internen K8s-Dienste weiterleiten. Diese öffentlichen Listener in Ingress müssen mit dem externen DNS übereinstimmen, den Sie für den Zugriff auf Ihre OpenStack-Bereitstellung einrichten. Beachten Sie, dass jede Regel auch über einen Dienst verfügt, der Ingress-Controllern den Zugriff auf die Endpunkte innerhalb des Clusters ermöglicht.

source: Examples
de: Beispiele

source: Exercise the Cloud
de: Trainieren der Cloud

source: External DNS and FQDN
de: Externer DNS und FQDN

source: External DNS to FQDN/Ingress
de: Externer DNS zu FQDN/Ingress

source: For ``identity`` and ``dashboard`` at ``host_fdqn_override.public`` replace ``null`` with the value as ``keystone.os.foo.org`` and ``horizon.os.foo.org``
de: Für ``identity`` und ``dashboard`` bei ``host_fdqn_override.public`` ersetzen Sie ``null`` durch den Wert ``keystone.os.foo.org`` und ``horizon.os.foo. org``

source: For a deployment without cinder and horizon the system requirements are:
de: Für eine Bereitstellung ohne Cinder und Horizon sind die Systemanforderungen:

source: For a lab or proof-of-concept environment, the OpenStack-Helm gate scripts can be used to quickly deploy a multinode Kubernetes cluster using KubeADM and Ansible. Please refer to the deployment guide `here <./kubernetes-gate.html>`__.
de: Für eine Labor- oder Proof-of-Concept-Umgebung können die OpenStack-Helm-Gate-Scripts verwendet werden, um einen Multinode-Kubernetes-Cluster mithilfe von KubeADM und Ansible schnell bereitzustellen. Weitere Informationen finden Sie im Bereitstellungshandbuch `hier <./kubernetes-gate.html>`__.

source: For other deployment options, select appropriate ``Deployment with ...`` option from `Index <../developer/index.html>`__ page.
de: Wählen Sie für andere Bereitstellungsoptionen die entsprechende Option `` Deployment with ... `` von der Seite `Index <../developer/index.html>`__.

source: Get the Nginx configuration from the Ingress Pod:
de: Holen Sie sich die Nginx-Konfiguration vom Ingress Pod:

source: Get the ``helm status`` of your chart.
de: Erhalten Sie den ``Helm Status`` Ihres Charts.

source: Horizon deployment is not tested in the OSH development environment community gates
de: Die Horizon-Bereitstellung wird nicht in den Community-Gates der OSH-Entwicklungsumgebung getestet

source: Host Configuration
de: Hostkonfiguration

source: If doing an `AIO install <https://docs.openstack.org/openstack-helm/latest/install/developer/index.html>`__, all the ``--set`` flags
de: Wenn Sie eine `AIO-Installation durchführen <https://docs.openstack.org/openstack-helm/latest/install/developer/index.html>`__, alle ``set`` Flags

source: Implementing the FQDN overrides **must** be done at install time. If you run these as helm upgrades, Ingress will notice the updates though none of the endpoint build-out jobs will run again, unless they are cleaned up manually or using a tool like Armada.
de: Die Implementierung der FQDN-Überschreibungen **muss** zur Installationszeit erfolgen. Wenn Sie diese als Helm-Upgrades ausführen, wird Ingress die Updates bemerken, aber keiner der Endpoint-Build-Out-Jobs wird erneut ausgeführt, es sei denn, sie werden manuell bereinigt oder mit einem Tool wie Armada.

source: In order to access your OpenStack deployment on Kubernetes we can use the Ingress Controller or NodePorts to provide a pathway in. A background on Ingress, OpenStack-Helm fully qualified domain name (FQDN) overrides, installation, examples, and troubleshooting will be discussed here.
de: Um auf Ihre OpenStack-Implementierung auf Kubernetes zuzugreifen, können wir den Ingress-Controller oder die NodePorts verwenden, um einen Pfad anzugeben. Ein Hintergrund zu Ingress, OpenStack-Helm vollständig qualifizierten Domänennamen (FQDN), Installation, Beispielen und Fehlerbehebung wird hier besprochen .

source: In order to deploy OpenStack-Helm behind corporate proxy servers, add the following entries to ``openstack-helm-infra/tools/gate/devel/local-vars.yaml``.
de: Um OpenStack-Helm hinter Corporate Proxy Servern zu deployen, fügen Sie folgende Einträge zu ``openstack-helm-infra/tools/gate/devel/local-vars.yaml`` hinzu.

source: In order to drive towards a production-ready OpenStack solution, our goal is to provide containerized, yet stable `persistent volumes <https://kubernetes.io/docs/concepts/storage/persistent-volumes/>`_ that Kubernetes can use to schedule applications that require state, such as MariaDB (Galera). Although we assume that the project should provide a "batteries included" approach towards persistent storage, we want to allow operators to define their own solution as well. Examples of this work will be documented in another section, however evidence of this is found throughout the project. If you find any issues or gaps, please create a `story <https://storyboard.openstack.org/#!/project/886>`_ to track what can be done to improve our documentation.
de: Um zu einer produktionsfertigen OpenStack-Lösung zu gelangen, ist es unser Ziel, containerisierte und dennoch stabile `persistente Datenträger bereitzustellen <https://kubernetes.io/docs/concepts/storage/persistent-volumes/>`_, die Kubernetes verwenden kann, um Anwendungen zu planen, die einen Zustand benötigen, wie MariaDB (Galera). Obwohl wir davon ausgehen, dass das Projekt einen ``Batteries included``-Ansatz für persistenten Speicher bereitstellen sollte, wollen wir es den Betreibern ermöglichen, auch ihre eigene Lösung zu definieren. Beispiele für diese Arbeit werden in einem anderen Abschnitt dokumentiert, der Nachweis dafür findet sich jedoch im gesamten Projekt. Wenn Sie Probleme oder Lücken finden, erstellen Sie bitte eine Story <https://storyboard.openstack.org/#!/project/886>`_ um zu verfolgen, was getan werden kann, um unsere Dokumentation zu verbessern.

source: Install OpenStack-Helm
de: Installiere OpenStack-Helm

source: It can be configured to give services externally-reachable URLs, load balance traffic, terminate SSL, offer name based virtual hosting, and more.
de: Es kann so konfiguriert werden, dass es extern erreichbare URLs bereitstellt, Last-Balance-Verkehr aufteilt, SSL beendet, namensbasiertes virtuelles Hosting anbietet und vieles mehr.

source: Kubernetes Preparation
de: Kubernetes Vorbereitung

source: Kubernetes and Common Setup
de: Kubernetes und gemeinsames Setup

source: Latest Version Installs
de: Neueste Version installiert

source: Look for *server* configuration with a *server_name* matching your desired FQDN
de: Suchen Sie nach *server* configuration mit einem *server_name*, der Ihrem gewünschten FQDN entspricht

source: Managing and configuring a Kubernetes cluster is beyond the scope of OpenStack-Helm and this guide.
de: Das Verwalten und Konfigurieren eines Kubernetes-Clusters geht über den Umfang von OpenStack-Helm und diesem Handbuch hinaus.

source: Many of the default container images that are referenced across OpenStack-Helm charts are not intended for production use; for example, while LOCI and Kolla can be used to produce production-grade images, their public reference images are not prod-grade. In addition, some of the default images use ``latest`` or ``master`` tags, which are moving targets and can lead to unpredictable behavior. For production-like deployments, we recommend building custom images, or at minimum caching a set of known images, and incorporating them into OpenStack-Helm via values overrides.
de: Viele der Standard-Containerabbilder, auf die in den OpenStack-Helmet-Charts verwiesen wird, sind nicht für den produktiven Einsatz vorgesehen. Während beispielsweise LOCI und Kolla für die Produktion von Abbildern in Produktionsqualität verwendet werden können, sind ihre öffentlichen Referenzabbilder keine Produktqualität. Darüber hinaus verwenden einige der Standardabbilder ``latest`` oder ``master``-Tags, bei denen es sich um bewegte Ziele handelt, die zu unvorhersehbarem Verhalten führen können. Für produktionsähnliche Bereitstellungen empfehlen wir, benutzerdefinierte Abbiler zu erstellen oder mindestens eine Reihe bekannter Abbildern zwischenzuspeichern und sie über Werteüberschreibungen in OpenStack-Helm zu integrieren.

source: Note if you need to make a DNS change, you will have to do uninstall (``helm delete <chart>``) and install again.
de: Hinweis: Wenn Sie eine DNS-Änderung vornehmen, müssen Sie eine Deinstallation durchführen (``helm delete <chart> ``) und erneut installieren.

source: Note that this command will only enable you to auth successfully using the ``python-openstackclient`` CLI. To use legacy clients like the ``python-novaclient`` from the CLI, reference the auth values in ``/etc/openstack/clouds.yaml`` and run::
de: Beachten Sie, dass Sie mit diesem Befehl nur autorisieren können, wenn Sie die CLI ``python-openstackclient`` verwenden. Um Legacy-Clients wie den `` python-novaclient`` aus der CLI zu verwenden, referenzieren Sie die Auth-Werte in ``/etc/openstack/clouds.yaml`` und führen Sie folgendes aus:

source: On the host or master node, install the latest versions of Git, CA Certs & Make if necessary
de: Installieren Sie auf dem Host- oder Master-Knoten die neuesten Versionen von Git, CA Certs & Make, falls erforderlich

source: On the master node create an environment file for the cluster:
de: Erstellen Sie auf dem Master-Knoten eine Umgebungsdatei für den Cluster:

source: On the master node create an inventory file for the cluster:
de: Erstellen Sie auf dem Master-Knoten eine Inventardatei für den Cluster:

source: On the master node run the playbooks:
de: Führen Sie auf dem Master-Knoten die Playbooks aus:

source: On the worker nodes:
de: Auf den Worker-Knoten:

source: Once OpenStack-Helm has been deployed, the cloud can be exercised either with the OpenStack client, or the same heat templates that are used in the validation gates.
de: Sobald OpenStack-Helm implementiert wurde, kann die Cloud entweder mit dem OpenStack-Client oder mit den gleichen Heat-Vorlagen, die in den Validierungsgates verwendet werden, ausgeführt werden.

source: Once installed, access the API's or Dashboard at `http://horizon.os.foo.org`
de: Nach der Installation greifen Sie auf die APIs oder das Dashboard unter ``http://horizon.os.foo.org`` zu

source: Once the host has been configured the repos containing the OpenStack-Helm charts should be cloned onto each node in the cluster:
de: Sobald der Host konfiguriert wurde, sollten die Repos, die die OpenStack-Helm-Charts enthalten, auf jeden Knoten im Cluster geklont werden:

source: Once the host has been configured the repos containing the OpenStack-Helm charts should be cloned:
de: Sobald der Host konfiguriert wurde, sollten die Repos mit den OpenStack-Helm Charts geklont werden:

source: OpenStack-Helm uses the hosts networking namespace for many pods including, Ceph, Neutron and Nova components. For this, to function, as expected pods need to be able to resolve DNS requests correctly. Ubuntu Desktop and some other distributions make use of ``mdns4_minimal`` which does not operate as Kubernetes expects with its default TLD of ``.local``. To operate at expected either change the ``hosts`` line in the ``/etc/nsswitch.conf``, or confirm that it matches:
de: OpenStack-Helm verwendet den Namensraum des Hosts für viele Pods, einschließlich Ceph-, Neutron- und Nova-Komponenten. Damit dies funktioniert, müssen Pods in der Lage sein, DNS-Anfragen korrekt aufzulösen. Ubuntu Desktop und einige andere Distributionen benutzen `` mdns4_minimal``, was nicht funktioniert, wie es Kubernetes mit seiner Standard-TLD `` .local`` erwartet. Um bei erwartet zu arbeiten, ändern Sie entweder die `` hosts`` Zeile in der ``/etc/nsswitch.conf``, oder bestätigen Sie, dass sie übereinstimmt:

source: OpenStack-Helm utilizes the `Kubernetes Ingress Controller <https://kubernetes.io/docs/concepts/services-networking/ingress/>`__
de: OpenStack-Helm verwendet den `Kubernetes Ingress Controller <https://kubernetes.io/docs/concepts/services-networking/ingress/>`__

source: OpenStack-Helm-Infra KubeADM deployment
de: OpenStack-Helm-Infra KubeADM-Bereitstellung

source: Other versions and considerations (such as other CNI SDN providers), config map data, and value overrides will be included in other documentation as we explore these options further.
de: Andere Versionen und Überlegungen (wie z.B. andere CNI-SDN-Anbieter), Konfigurationskartendaten und Wertüberschreibungen werden in der weiteren Dokumentation enthalten sein, wenn wir diese Optionen weiter untersuchen.

source: Overview
de: Überblick

source: Passwordless Sudo
de: Passwortloses Sudo

source: Please see the supported application versions outlined in the `source variable file <https://github.com/openstack/openstack-helm-infra/blob/master/roles/build-images/defaults/main.yml>`_.
de: Bitte beachten Sie die unterstützten Anwendungsversionen, die in der `Quellvariablendatei beschrieben sind <https://github.com/openstack/openstack-helm-infra/blob/master/roles/build-images/defaults/main.yml>`_.

source: Prepare ahead of time your FQDN and DNS layouts. There are a handful of OpenStack endpoints you will want to expose for API and Dashboard access.
de: Bereiten Sie Ihre FQDN- und DNS-Layouts im Voraus vor. Es gibt eine Handvoll OpenStack-Endpunkte, die für API- und Dashboard-Zugriff verfügbar sein sollen.

source: Proxy Configuration
de: Proxy-Konfiguration

source: Removing Helm Charts
de: Helm-Charts entfernen

source: Requirements
de: Anforderungen

source: Requirements and Host Configuration
de: Anforderungen und Hostkonfiguration

source: Run the playbooks
de: Führen Sie die Playbooks aus

source: SSH-Key preparation
de: SSH-Schlüssel Vorbereitung

source: Set correct ownership: ``sudo chown ubuntu /etc/openstack-helm/deploy-key.pem``
de: Setzen Sie die korrekten Dateirechte: ``sudo chown ubuntu /etc/openstack-helm/deploy-key.pem``
