Repository: zhen00fa/helm-openstack
Catalog: openstack-helm/doc/source/locale/*/LC_MESSAGES/doc-specs.po
Languages: id

source: The OpenStack-Helm release process will be somewhat orthogonal to the OpenStack release process, and the differences and relationship between the two must be documented in a spec. This will help folks quickly understand why OpenStack-Helm is a Release-Independent project from an OpenStack perspective.
id: Proses rilis OpenStack-Helm akan sedikit ortogonal untuk proses rilis OpenStack, dan perbedaan dan hubungan antara keduanya harus didokumentasikan dalam sebuah spec. Ini akan membantu orang dengan cepat memahami mengapa OpenStack-Helm adalah proyek Release-Independent dari perspektif OpenStack.

source: The ``profiles`` yaml files (for example ``centos_7``, ``opensuse_15``) will be provided in each chart's ``example_values/`` directory. This folder will be masked to helm through a helmignore file. Its content is only for user consumption, not for inclusion in helm charts through the File directive. In other words, this is a user interface given for convenience merely using the abilities of the existing helm charts.
id: File ``profile`` yaml (misalnya ``centos_7``, ``opensuse_15``) akan disediakan di setiap direktori ``example_values/`` chart. Folder ini akan ditutup untuk dikunci melalui file helmignore. Kontennya hanya untuk konsumsi pengguna, bukan untuk dimasukkan dalam helm chart melalui arahan File. Dengan kata lain, ini adalah antarmuka pengguna yang diberikan untuk kenyamanan hanya menggunakan kemampuan helm chart yang ada.

source: The above chart must include sensible configuration values to make the logging platform usable by default. These include: proper input configurations for both Fluentbit and Fluentd, proper output configurations for both Fluentbit and Fluentd, proper metadata and formats applied to the logs via Fluentd.
id: Bagan di atas harus menyertakan nilai konfigurasi yang masuk akal untuk membuat platform logging dapat digunakan secara default. Ini termasuk: konfigurasi input yang tepat untuk Fluentbit dan Fluentd, konfigurasi output yang tepat untuk Fluentbit dan Fluentd, metadata yang tepat dan format yang diterapkan pada log melalui Fluentd.

source: The alternative is to provide no organization layout for charts across all openstack-helm repositories.
id: Alternatifnya adalah tidak menyediakan tata letak organisasi untuk chart di semua repositori openstack-helm.

source: The alternative would be to continue supporting the current bash driven containerized KubeADM and Kubelet approach, though this has the following issues:
id: Alternatifnya adalah untuk terus mendukung pendekatan Kubelet dan bash driven containerized KubeADM saat ini, meskipun ini memiliki masalah sebagai berikut:

source: The bash scripts are largely undocumented and have grown to the point where they are very hard for a new developer to work on.
id: Script bash sebagian besar tidak berdokumen dan telah berkembang ke titik di mana mereka sangat sulit untuk dikembangkan oleh pengembang baru.

source: The code can be supplied as modified neutron server image, or plugin can be mounted to original image. The :code:`manifests` section in :code:`neutron/values.yaml` should be enabled for below components:
id: Kode dapat diberikan sebagai image server neutron yang dimodifikasi, atau plugin dapat dipasang ke image asli. Bagian :code:`manifests` dalam :code:`neutron/values.yaml` harus diaktifkan untuk komponen di bawah ini:

source: The containerized Kubelet cannot survive a restart, as it does not setup mounts correctly.
id: Kubelet containerized tidak dapat selamat dari restart, karena ia tidak memasang mount dengan benar.

source: The credentials for the registry could be exposed by running the kubectl command: kubectl get secret <secret-name> --output="jsonpath={.data.\.dockerconfigjson}" | base64 --decode
id: Kredensial untuk registri dapat diekspos dengan menjalankan perintah kubectl: kubectl get secret <secret-name> --output="jsonpath={.data.\.dockerconfigjson}" | base64 --decode

source: The default ``values.yaml`` need to expose those abilities, by adding a new series of keys/values to add the necessary features.
id: Default ``values.yaml`` perlu mengekspos kemampuan itu, dengan menambahkan serangkaian keys/values baru untuk menambahkan fitur yang diperlukan.

source: The detailed proposes change are described as following:
id: Usulan perubahan yang rinci dijelaskan sebagai berikut:

source: The developer documentation in OpenStack-Helm should be updated to guide key ordering on value files.
id: Dokumentasi pengembang di OpenStack-Helm harus diperbarui untuk memandu pengurutan kunci pada file nilai.

source: The developer documentation in OpenStack-Helm should be updated to match the gated developer deploy process.
id: Dokumentasi pengembang di OpenStack-Helm harus diperbarui agar sesuai dengan proses penerapan pengembang yang terjaga keamanannya.

source: The existing schema for images is the following:
id: Skema yang ada untuk image adalah sebagai berikut:

source: The following work items need to be completed for this Specification to be implemented.
id: Item pekerjaan berikut ini perlu diselesaikan agar Spesifikasi ini dapat diimplementasikan.

source: The following work items need to be completed for this specification to be implemented.
id: Item pekerjaan berikut ini perlu diselesaikan agar spesifikasi ini dapat diimplementasikan.

source: The last thing to be considered is VM network virtualization. What engine does SDN use? It is OpenVSwitch, Linux Bridges or l3 routing (no l2 connectivity). If SDN is using the OpenVSwitch, it can take advantage of existing OVS daemonsets. Any modification that would be required to OVS manifests can be included in base Neutron chart as a configurable option. In that way, the features of OVS can be shared between different SDNs. When using the OVS, default Neutron L2 agent should be disabled, but OVS-DB and OVS-vswitchd can be left enabled.
id: Hal terakhir yang harus dipertimbangkan adalah VM network virtualization. Mesin apa yang SDN gunakan? Ini adalah OpenVSwitch, Linux Bridges atau l3 routing (tanpa konektivitas l2). Jika SDN menggunakan OpenVSwitch, ia dapat memanfaatkan daemonset OVS yang ada. Setiap modifikasi yang akan diperlukan untuk manifes OVS dapat dimasukkan dalam chart Neutron dasar sebagai opsi yang dapat dikonfigurasi. Dengan cara itu, fitur OVS dapat dibagi antara SDN yang berbeda. Saat menggunakan OVS, agen Neutron L2 default harus dinonaktifkan, tetapi OVS-DB dan OVS-vswitchd dapat dibiarkan aktif.

source: The monolithic Ceph chart does not allow for following Ceph upgrade best practices, namely to upgrade Mons, OSDs, and client services in that order. The Ceph chart must therefore be split into at least three charts (one for each of the above upgrade phases) prior to 1.0 to ensure smooth in-place upgradability.
id: Chart Ceph monolitik tidak memungkinkan untuk mengikuti praktik terbaik upgrade Ceph, yaitu untuk upgrade Mons, OSD, dan layanan klien dalam urutan itu. Oleh karena itu, Ceph chart harus dibagi menjadi setidaknya tiga chart (satu untuk masing-masing fase peningkatan di atas) sebelum 1.0 untuk memastikan kelancaran upgrade in-place.

source: The move to Zuulv3 native operation of the OpenStack-Helm gates mean there would be no code reuse between the gate and developer environments, so supporting the existing code for Zuulv2 will incur significant tech-debt.
id: Perpindahan ke operasi asli Zuulv3 dari gate OpenStack-Helm berarti tidak akan ada kode yang digunakan kembali antara gate dan lingkungan pengembang, sehingga mendukung kode yang ada untuk Zuulv2 akan menimbulkan tech-debt yang signifikan.

source: The option ``enabled:`` under ``auth:`` and the manifest ``secret_registry:`` provide the ability for operator to determine whether they would like to have secrets generated and passed to kubernetes for pulling images.
id: Opsi ``enabled:`` di bawah ``auth:`` dan manifes ``secret_registry:`` memberikan kemampuan bagi operator untuk menentukan apakah mereka ingin memiliki rahasia yang dihasilkan dan diteruskan ke kubernetes untuk menarik image.

source: The performance aspect of these point are restricted to deployment, and have no performance impact on operations.
id: Aspek kinerja point ini dibatasi untuk penggunaan, dan tidak memiliki dampak kinerja pada operasi.

source: The proposal includes the following:
id: Proposal tersebut meliputi:

source: The proposed requirements for a 1.0 release are as follows:
id: Persyaratan yang diusulkan untuk rilis 1.0 adalah sebagai berikut:

source: The proposes change would be to add in :code:`neutron/values.yaml` new section with boolean values describing which Neutron's Kubernetes resources should be enabled:
id: Perubahan yang diajukan adalah menambahkan :code:`neutron/values.yaml` bagian baru dengan nilai boolean yang menggambarkan sumber daya Kubernet Neutron mana yang harus diaktifkan:

source: The requirements for a logging collector/aggregator include:
id: Persyaratan untuk kolektor/agregator logging meliputi:

source: The requirements for a logging platform include:
id: Persyaratan untuk platform logging meliputi:

source: The requirements for a monitoring platform include:
id: Persyaratan untuk platform pemantauan meliputi:

source: The secret would not be created with the default option ``enabled: false`` and ``secret_registry: true``. To enable secret creation, operator should override ``enabled:`` to true. The above example shows the default credentials, operator should override the ``username:`` and ``password:`` under ``auth:`` section to provide their own credentials.
id: Rahasia tidak akan dibuat dengan opsi default ``enabled: false`` dan ``secret_registry: true``. Untuk mengaktifkan pembuatan rahasia, operator harus mengganti ``enabled:`` menjadi true. Contoh di atas menunjukkan kredensial default, operator harus mengganti ``username:`` and ``password:`` di bawah bagian ``auth:`` untuk memberikan kredensial mereka sendiri.

source: The testing will be performed by the OpenStack-Helm gate to demonstrate the sidecar container correctly routes traffic to the correct services.
id: Pengujian akan dilakukan oleh gate OpenStack-Helm untuk mendemonstrasikan sidecar container dengan benar mengarahkan lalu lintas ke layanan yang benar.

source: The top-level keys are based on the organizational keys common to all charts in the openstack-helm repositories. The top-level keys are strictly ordered according to function, which creates a common organization pattern between all charts.
id: Top-level keys didasarkan pada kunci organisasi yang umum untuk semua chart di repositori openstack-helm. Top-level keys diatur secara ketat sesuai dengan fungsinya, yang menciptakan pola organisasi yang sama di antara semua chart.

source: Then, add manifest ``secret-registry.yaml`` in ``templates/`` to leverage the function that will be added in helm-toolkit to create the secret. For example:
id: Kemudian, tambahkan manifes ``secret-registry.yaml`` di ``templates/`` untuk meningkatkan fungsi yang akan ditambahkan dalam helm-toolkit untuk membuat rahasia. Sebagai contoh:

source: Then, inside Kubernetes manifests, add global if statement, deciding if given manifest should be declared on Kubernetes API, for example :code:`neutron/templates/daemonset-ovs-agent.yaml`:
id: Kemudian, di dalam manifes Kubernetes, tambahkan global if statement, putuskan jika manifes yang diberikan harus dideklarasikan pada API Kubernetes, misalnya :code:`neutron/templates/daemonset-ovs-agent.yaml`:

source: There is no significant performance impact as the traffic will be locally routed (via 127.0.0.1) and may potentially improve performance for services whose native TLS handling is inefficient.
id: Tidak ada dampak kinerja yang signifikan karena lalu lintas akan dirutekan secara lokal (melalui 127.0.0.1) dan berpotensi meningkatkan kinerja untuk layanan yang penanganan TLS native tidak efisien.

source: There will be no security impact, as it will deploy the charts in OpenStack-Helm[-infra/-addons] upon a reference KubeADM administered cluster.
id: Tidak akan ada dampak keamanan, karena akan menyebarkan grafik di OpenStack-Helm[-infra/-addons] pada cluster yang dikelola KubeADM referensi

source: This Ceph cluster will be used by Cinder and Glance as storage backend.
id: Cluster Ceph ini akan digunakan oleh Cinder dan Glance sebagai backend penyimpanan.

source: This Ceph cluster will be used for k8s RBD storage (pvc). This can be used by entire Kubernetes cluster.
id: Cluster Ceph ini akan digunakan k8s RBD storage (pvc). Ini dapat digunakan oleh seluruh cluster Kubernetes.

source: This approach:
id: Pendekatan ini:

source: This deployment process will be gated, to ensure that the development the environment is consistently working against ``master`` for the OpenStack-Helm repositories.
id: Proses deployment ini akan terjaga keamanannya, untuk memastikan bahwa pengembangan lingkungan bekerja secara konsisten terhadap ``master`` untuk repositori OpenStack-Helm.

source: This enhances the system's security design by allowing pods with services that cannot natively manage TLS to secure the traffic to the service pod.
id: Ini meningkatkan desain keamanan sistem dengan memungkinkan pod dengan layanan yang tidak dapat mengelola TLS untuk mengamankan lalu lintas ke pod layanan.

source: This feature will not affect the performance of OpenStack-Helm.
id: Fitur ini tidak akan mempengaruhi kinerja OpenStack-Helm.

source: This guide shows how to setup multiple Ceph clusters. One Ceph cluster will be used for k8s RBD storage and while other Ceph cluster will be for tenant facing storage backend for Cinder and Glance.
id: Panduan ini menunjukkan cara mengatur multiple cluster Ceph. Satu cluster Ceph akan digunakan untuk penyimpanan RBD k8s dan sementara cluster Ceph lainnya akan untuk penyewa menghadapi backend penyimpanan untuk Cinder dan Glance.

source: This spec describes a point-in-time readiness for OpenStack-Helm 1.0, after which it will be for historical reference only.
id: Spesifikasi ini menggambarkan kesiapan point-in-time untuk OpenStack-Helm 1.0, setelah itu hanya untuk referensi sejarah.

source: This spec describes a wide variety of self-contained work efforts, which will be implemented individually by the whole OpenStack-Helm team.
id: Spesifikasi ini menjelaskan berbagai upaya kerja mandiri, yang akan dilaksanakan secara individual oleh seluruh tim OpenStack-Helm.

source: This spec lays out the criteria for a stable and reliable 1.0 release, which can serve as the basis for real-world use as well as ongoing development. The alternative approaches would be to either iterate indefinitely without defining a 1.0 release, which would fail to signal to operators the point at which the platform is ready for real-world use; or, to define a 1.0 release which fails to satisfy key features which real-world operators need.
id: Spesifikasi ini menjabarkan kriteria untuk rilis 1.0 yang stabil dan andal, yang dapat berfungsi sebagai dasar untuk penggunaan di real-world serta pengembangan yang berkelanjutan. Pendekatan alternatif adalah untuk melakukan iterate tanpa batas tanpa mendefinisikan rilis 1.0, yang akan gagal memberi sinyal kepada operator, titik di mana platform siap untuk penggunaan real-world; atau, untuk menentukan rilis 1.0 yang gagal memenuhi fitur utama yang dibutuhkan operator real-world.

source: This spec will be worked helm chart by helm chart, starting with keystone.
id: Spesifikasi ini akan dikerjakan helm chart dengan helm chart, dimulai dengan keystone.

source: This specification also proposes to restrict the addition of any new top-level keys in charts across all OpenStack-Helm repositories, in order to maintain the common structure the ordering creates. The addition of a new top-level key shall be agreed upon by the OpenStack-Helm team on a case-by-case basis. The addition of any new top-level keys should be documented, and this specification shall be amended to account for any added keys.
id: Spesifikasi ini juga mengusulkan untuk membatasi penambahan top-level keys baru dalam chart di semua repositori OpenStack-Helm, untuk menjaga struktur umum yang dibuat oleh pengurutan. Penambahan top-level key yang baru harus disetujui oleh tim OpenStack-Helm berdasarkan kasus per kasus. Penambahan top-level key yang baru harus didokumentasikan, dan spesifikasi ini harus diubah untuk memperhitungkan setiap kunci yang ditambahkan.

source: This specification proposes defining entries in the values.yaml file into two categories: top-level keys, and their children (sub-level) keys.
id: Spesifikasi ini mengusulkan pendefinisian entri dalam file values.yaml ke dalam dua kategori: top-level keys, dan their children (sub-level) keys.

source: This specification proposes introducing a uniform values.yaml structure across all charts in openstack-helm, openstack-helm-infra, and openstack-helm-addons, with the goal of reducing the complexities of working across multiple charts and reducing the effort for creating new charts.
id: Spesifikasi ini mengusulkan untuk memperkenalkan nilai yang seragam. Struktur yaml di semua chart di openstack-helm, openstack-helm-infra, dan openstack-helm-addons, dengan tujuan mengurangi kompleksitas bekerja di berbagai chart dan mengurangi upaya untuk menciptakan chart yang baru.

source: This specification proposes to add a nginx sidecar container to the pod for service that requires the tls offloading. The nginx can be used to handle the TLS offoading and terminate the TLS connection, and routes the traffic to the service via localhost (127.0.0.1).
id: Spesifikasi ini mengusulkan untuk menambahkan kontainer sidecar nginx ke pod untuk layanan yang memerlukan pembongkaran tls. Nginx dapat digunakan untuk menangani pemutusan TLS dan mengakhiri koneksi TLS, dan merutekan (route) lalu lintas ke layanan melalui localhost (127.0.0.1).

source: This specification will address enablement of LinuxBridge network virtualization for OpenStack Helm (OSH). LinuxBridge is second available networking technology in Neutron's reference architecture. The first one is OVS, that is already implemented in OSH.
id: Spesifikasi ini akan membahas pemberlakuan virtualisasi jaringan LinuxBridge untuk OpenStack Helm (OSH). LinuxBridge adalah teknologi jaringan kedua yang tersedia dalam arsitektur referensi Neutron. Yang pertama adalah OVS, yang sudah diimplementasikan dalam OSH.

source: Time-series database for collected metrics
id: Database time-serie untuk metrik yang dikumpulkan

source: Time-series database for logs collected
id: Database time-series untuk log dikumpulkan

source: To be able to install Neutron with multiple possible SDNs as networking plugin, Neutron chart should be modified to enable installation of base services with decomposable approach. This means that operator can define which components from base Neutron chart should be installed, and which should not. This plus proper configuration of Neutron chart would enable operator to flexibly provision OpenStack with chosen SDN.
id: Untuk dapat menginstal Neutron dengan beberapa kemungkinan SDN sebagai plugin jaringan, chart Neutron harus dimodifikasi untuk memungkinkan instalasi layanan dasar dengan pendekatan yang dapat didekomposisi. Ini berarti bahwa operator dapat menentukan komponen mana dari chart Neutron dasar yang harus dipasang, dan mana yang tidak. Konfigurasi chart Neutron plus yang tepat ini akan memungkinkan operator untuk secara fleksibel menyediakan OpenStack dengan SDN yang dipilih.

source: To be able to pull images from an OCI image registry which has the authentication turned on, kubernetes needs credentials. For each chart, a new ``endpoints:`` entry could be added in ``values.yaml`` to provide image credentials, a secret needs to be generated to hold the credentials and the ``imagePullSecrets:`` field should be added in each service account to specify which secret should be used to get the credentials from when pulling images by kubelet.
id: Untuk dapat menarik image dari registri image OCI yang otentikasi dihidupkan, kubernetes memerlukan kredensial. Untuk setiap chart, entri ``endpoints:`` baru dapat ditambahkan dalam ``values.yaml`` untuk memberikan kredensial image, rahasia perlu dibuat untuk memegang kredensial dan field ``imagePullSecrets:`` harus berupa ditambahkan di setiap akun layanan untuk menentukan rahasia mana yang harus digunakan untuk mendapatkan kredensial mulai saat menarik image dengan kubelet.

source: To enable new SDN solution, there should be separate chart created, which would handle the deployment of service, setting up the database and any related networking functionality that SDN is providing.
id: Untuk mengaktifkan solusi SDN baru, harus ada chart terpisah yang dibuat, yang akan menangani penyebaran layanan, pengaturan basis data dan segala fungsi jaringan terkait yang disediakan oleh SDN.

source: To facilitate effective collaboration and communication across the OpenStack-Helm community team, work items for the enhancements above will be captured in Storyboard. Therefore, migration from Launchpad to Storyboard must be accomplished prior to the 1.0 release. Going forward, Storyboard will be leveraged as a tool to collaboratively define and communicate the OpenStack-Helm roadmap.
id: Untuk memfasilitasi kolaborasi dan komunikasi yang efektif di seluruh tim komunitas OpenStack-Helm, item pekerjaan untuk peningkatan di atas akan ditangkap di Storyboard. Oleh karena itu, migrasi dari Launchpad ke Storyboard harus diselesaikan sebelum rilis 1.0. Ke depan, Storyboard akan dimanfaatkan sebagai alat untuk secara kolaboratif mendefinisikan dan mengkomunikasikan roadmap OpenStack-Helm.

source: To minimize the performance impacts, the following should be considered:
id: Untuk meminimalkan dampak kinerja, hal-hal berikut harus dipertimbangkan:

source: To successfully enforce the ordering defined here, our gates need a method for validating the ordering and the schema of all values.yaml files. Without such a mechanism, the overhead associated with properly reviewing and validating any changes to the structure will be substantial. A tool, such as yamllint, would provide this functionality and remove the need to write a custom validation tool
id: Untuk berhasil menegakkan pengurutan yang ditentukan di sini, gate kami memerlukan metode untuk memvalidasi pengurutan dan skema semua file values.yaml. Tanpa mekanisme seperti itu, overhead yang terkait dengan meninjau dan memvalidasi setiap perubahan pada struktur akan menjadi substansial. Alat, seperti yamllint, akan menyediakan fungsi ini dan menghapus kebutuhan untuk menulis alat validasi kustom.

source: Top-level keys are placed in this order:
id: Top-level keys ditempatkan dalam urutan ini:

source: Trigger alerts when desired replicas fall below required number
id: Peringatan pemicu ketika replika yang diinginkan berada di bawah angka yang dibutuhkan

source: Trigger alerts when services become unavailable or unresponsive
id: Pemicu peringatan ketika layanan menjadi tidak tersedia atau tidak responsif

source: Under storage: mon directory have been updated.
id: Di bawah penyimpanan: direktori mon telah diperbarui.

source: Under storageclass section, values for following have been updated: ceph_configmap_name, admin_secret_name, admin_secret_namespace, user_secret_name
id: Di bawah bagian storageclass, nilai untuk yang berikut telah diperbarui: ceph_configmap_name, admin_secret_name, admin_secret_namespace, user_secret_name

source: Update ``helm toolkit`` to provide snippet to create the nginx sidecar container for the services that require it.
id: Perbarui ``helm toolkit`` untuk memberikan cuplikan untuk membuat nginx sidecar container untuk layanan yang membutuhkannya.
