Repository: zhen00fa/helm-openstack
Catalog: openstack-helm/doc/source/locale/*/LC_MESSAGES/doc-specs.po
Languages: id

source: Documentation on how to use LinuxBridge with Neutron chart.
id: Dokumentasi tentang cara menggunakan LinuxBridge dengan chart Neutron.

source: Documentation should be included for each of the included charts as well as documentation detailing the requirements for a usable monitoring platform, preferably with sane default values out of the box.
id: Dokumentasi harus disertakan untuk masing-masing grafik termasuk juga dokumentasi yang merinci persyaratan untuk platform pemantauan yang dapat digunakan, lebih disukai dengan default values out of the box yang masuk akal.

source: Duplicate scripts as shows below for later use.
id: Duplikat skrip seperti yang ditunjukkan di bawah ini untuk digunakan nanti.

source: Dynamically alter webserver environment conditionally in the helm chart. For example, for apache, ensure the necessary modules to run openstack are available and loaded at helm chart deploy time. This will leverage the binaries listed in ``values.yaml``. These series of commands are distribution/image dependent, as commands to list modules to load might differ. However with a few parameters, we can get a very distro independent process which would allow us to load all the required apache modules.
id: Secara dinamis mengubah lingkungan server web secara kondisional di helm chart. Sebagai contoh, untuk apache, pastikan modul yang diperlukan untuk menjalankan openstack tersedia dan dimuat pada waktu penggelaran helm chart. Ini akan memanfaatkan binari yang terdaftar di ``values.yaml``. Rangkaian perintah ini bergantung pada distribution/image, karena perintah untuk mendaftar modul yang akan dimuat mungkin berbeda. Namun dengan beberapa parameter, kita bisa mendapatkan proses independen distro yang memungkinkan kita memuat semua modul apache yang diperlukan.

source: Each chart's values.yaml file contains various settings such as docker image definition, chart structure setting, form of the resources being distributed, and process configuration. Currently, the structure of the yaml file is complicated, and finding keys between charts proves difficult due to the lack of uniform values organization across charts.
id: Setiap file values.yaml chart berisi berbagai pengaturan seperti definisi docker image, pengaturan struktur chart, bentuk sumber daya yang didistribusikan, dan konfigurasi proses. Saat ini, struktur file yaml rumit, dan menemukan kunci di antara chart terbukti sulit karena kurangnya nilai seragam organisasi di seluruh chart.

source: Edit all helm charts to remove possible references to image specific elements, replacing them with values overrides or conditionals.
id: Edit semua bagan helm untuk menghapus referensi yang mungkin untuk elemen spesifik image, override dengan nilai yang menimpa atau kondisional.

source: Elasticsearch configured in a highly available manner with sane defaults
id: Elasticsearch dikonfigurasi dengan cara yang sangat tersedia dengan standar yang masuk akal

source: Elasticsearch configured to prevent memory swapping to disk
id: Elasticsearch dikonfigurasi untuk mencegah pertukaran memori ke disk

source: Every Fluentbit send logs to Fluentd with Kubernetes metadata attached
id: Setiap Fluentbit mengirim log ke Fluentd dengan metadata Kubernetes terlampir

source: Every Kubernetes manifest inside Neutron chart can be enabled or disabled. That would provide flexibility to the operator, to choose which Neutron components are reusable with different type of SDNs. For example, neutron-server which is serving the API and configuring the database can be used with different types of SDN plugin, and provider of that SDN chart would not need to copy all logic from Neutron base chart to manage the API and database.
id: Setiap manifes Kubernet dalam chart Neutron dapat diaktifkan atau dinonaktifkan. Itu akan memberikan fleksibilitas kepada operator, untuk memilih komponen Neutron mana yang dapat digunakan kembali dengan berbagai jenis SDN. Misalnya, server neutron yang melayani API dan mengonfigurasi basis data dapat digunakan dengan berbagai jenis plugin SDN, dan penyedia chart SDN itu tidak perlu menyalin semua logika dari chart dasar Neutron untuk mengelola API dan basis data.

source: Example OpenStack-Helm metrics requiring monitoring include:
id: Contoh metrik OpenStack-Helm yang membutuhkan pemantauan meliputi:

source: Example uses for centralized logging include:
id: Contoh penggunaan untuk logging terpusat meliputi:

source: Example uses for centralized logging with Fluentbit and Fluentd include:
id: Contoh penggunaan untuk logging terpusat dengan Fluentbit dan Fluentd meliputi:

source: Examples of how these metrics can be used include:
id: Contoh bagaimana metrik ini dapat digunakan meliputi:

source: Examples of how to set up the above under KubeADM and KubeSpray-based clusters must be documented as well.
id: Contoh cara mengatur di atas di bawah KubeADM dan cluster berbasis KubeSpray harus didokumentasikan juga.

source: Execute script
id: Jalankan skrip

source: Execute script.
id: Jalankan skrip.

source: Exposes security/configuration features of software, allowing deployers to configure software to their needs.
id: Mengekspos fitur security/configuration perangkat lunak, memungkinkan penyebar untuk mengkonfigurasi perangkat lunak sesuai kebutuhan mereka.

source: Find all backtraces for a tenant id's uuid
id: Temukan semua backtraces untuk uuid id penyewa

source: Find all logged events that match a pattern (service, pod, behavior, etc)
id: Temukan semua peristiwa yang dicatat yang cocok dengan pola (layanan, pod, perilaku, dll)

source: First reasonable testing in gates would be to setup Linux Bridge and check if VM network connectivity is working.
id: Pengujian masuk akal pertama di gate adalah untuk mengatur Linux Bridge dan memeriksa apakah konektivitas jaringan VM berfungsi.

source: Fluentbit, Fluentd meet OpenStack-Helm's logging requirements for gathering, aggregating, and delivering of logged events. Fluntbit runs as a daemonset on each node and mounts the /var/lib/docker/containers directory. The Docker container runtime engine directs events posted to stdout and stderr to this directory on the host. Fluentbit then forward the contents of that directory to Fluentd. Fluentd runs as deployment at the designated nodes and expose service for Fluentbit to forward logs. Fluentd should then apply the Logstash format to the logs. Fluentd can also write Kubernetes and OpenStack metadata to the logs. Fluentd will then forward the results to Elasticsearch and to optionally Kafka. Elasticsearch indexes the logs in a logstash-* index by default. Kafka stores the logs in a 'logs' topic by default. Any external tool can then consume the 'logs' topic.
id: Fluentbit, Fluentd memenuhi persyaratan logging OpenStack-Helm untuk mengumpulkan, mengagregasi, dan mengirimkan peristiwa yang dicatat. Fluntbit berjalan sebagai daemonset pada setiap node dan me-mount direktori /var/lib/docker/containers. Mesin runtime kontainer Docker mengarahkan event yang diposting ke stdout dan stderr ke direktori ini di host. Fluentbit kemudian meneruskan isi direktori itu ke Fluentd. Fluentd berjalan sebagai penyebaran di node yang ditunjuk dan mengekspos layanan untuk Fluentbit untuk meneruskan log. Fluentd kemudian harus menerapkan format Logstash ke log. Fluentd juga dapat menulis metadata Kubernetes dan OpenStack ke log. Fluentd kemudian akan meneruskan hasilnya ke Elasticsearch dan ke opsional Kafka. Elasticsearch mengindeks log dalam logstash-* index secara default. Kafka menyimpan log dalam topik 'log' secara default. Alat eksternal apa pun kemudian dapat menggunakan topik 'log'.

source: Fluentd properly filters and categorizes logs
id: Fluentd memfilter dan mengkategorikan log dengan benar

source: Fluentd send aggregated logs to Elasticsearch for the internal use cases
id: Fluentd mengirim log agregat ke Elasticsearch untuk kasus penggunaan internal

source: Fluentd then attaches Kubernetes and/or OpenStack metadata
id: Fluentd kemudian melampirkan Kubernetes dan/atau metadata OpenStack

source: Fluentd, Elasticsearch, and Kibana meet OpenStack-Helm's logging requirements for capture, storage and visualization of logged events. Fluentd runs as a daemonset on each node and mounts the /var/lib/docker/containers directory. The Docker container runtime engine directs events posted to stdout and stderr to this directory on the host. Fluentd should then declare the contents of that directory as an input stream, and use the fluent-plugin-elasticsearch plugin to apply the Logstash format to the logs. Fluentd will also use the fluentd-plugin-kubernetes-metadata plugin to write Kubernetes metadata to the log record. Fluentd will then forward the results to Elasticsearch, which indexes the logs in a logstash-* index by default. The resulting logs can then be queried directly through Elasticsearch, or they can be viewed via Kibana. Kibana offers a dashboard that can create custom views on logged events, and Kibana integrates well with Elasticsearch by default.
id: Fluentd, Elasticsearch, dan Kibana memenuhi persyaratan logging OpenStack-Helm untuk menangkap, menyimpan, dan memvisualisasikan event yang dicatat. Fluentd berjalan sebagai daemonset pada setiap node dan me-mount direktori /var/lib/docker/containers. Mesin runtime kontainer Docker mengarahkan event yang diposting ke stdout dan stderr ke direktori ini di host. Fluentd kemudian harus mendeklarasikan isi direktori itu sebagai aliran input, dan menggunakan plugin fluent-plugin-elasticsearch untuk menerapkan format Logstash ke log. Fluentd juga akan menggunakan plugin fluentd-plugin-kubernetes-metadata untuk menulis metadata Kubernetes ke catatan log. Fluentd kemudian akan meneruskan hasilnya ke Elasticsearch, yang secara default mengindeks log dalam indeks logstash-*. Log yang dihasilkan kemudian dapat ditanyakan langsung melalui Elasticsearch, atau mereka dapat dilihat melalui Kibana. Kibana menawarkan dasbor yang dapat membuat tampilan kustom pada event yang dicatat, dan Kibana terintegrasi dengan baik dengan Elasticsearch secara default.

source: For Tenant Ceph, we will not be provisioning storage classes therefor, update script to not install ceph-provisioners chart as following.
id: Untuk Tenant Ceph, kami tidak akan menyediakan kelas penyimpanan karenanya, update skrip untuk tidak memasang chart ceph-provisioners sebagai berikut.

source: For the ``Category B`` helm charts, an informal testing has been done in the past to ensure image independence. However, there is nothing exercising this independence in gates. Due to that, code of the helm charts might or might not require adapting.
id: Untuk ``Category B`` helm chart, pengujian informal telah dilakukan di masa lalu untuk memastikan independensi image. Namun, tidak ada yang melaksanakan independensi ini di gate. Karena itu, kode helm chart mungkin perlu atau tidak perlu diadaptasi.

source: For this spec, we assume ``imagename1`` and ``imagename2`` are similarly built. This means we do not require any override per image. Instead we require a generic kind of override, per application, usable by all charts.
id: Untuk spek ini, kami mengasumsikan ``imagename1`` dan ``imagename2`` dibangun dengan cara yang sama. Ini berarti kami tidak memerlukan penggantian apa pun per image. Sebagai gantinya, kami memerlukan jenis override umum, per aplikasi, dapat digunakan oleh semua chart.

source: Gate job testing VM network connectivity.
id: Gate job testing konektivitas jaringan VM

source: Gating must prove that upgrades from each supported OpenStack version to the next operate flawlessly, using the default image set (LOCI). Specifically, each OpenStack chart should be upgraded from one release to the next, and each infrastructure service from one minor version to the next. Both the container image and configuration must be modified as part of this upgrade. At minimum, Newton to Ocata upgrade must be validated for the 1.0 release.
id: Gating harus membuktikan bahwa upgrade dari setiap versi OpenStack yang didukung ke operasi selanjutnya dengan sempurna, menggunakan set image default (LOCI). Secara khusus, setiap bagan OpenStack harus ditingkatkan dari satu rilis ke yang berikutnya, dan setiap layanan infrastruktur dari satu versi minor ke yang berikutnya. Baik image kontainer maupun konfigurasi harus dimodifikasi sebagai bagian dari upgrade ini. Minimal, upgrade Newton ke Ocata harus divalidasi untuk rilis 1.0.

source: Having services configured, also the services pod dependencies should be updated to reflect the new kind on L2 agent:
id: Setelah layanan dikonfigurasi, dependensi pod layanan juga harus diperbarui untuk mencerminkan jenis baru pada agen L2:

source: Helm chart for Alertmanager
id: Helm chart untuk Alertmanager

source: Helm chart for Elasticsearch
id: Helm chart untuk Elasticsearch

source: Helm chart for Fluentbit-Fluentd Combination
id: Helm chart untuk Fluentbit-Fluentd Combination

source: Helm chart for Fluentd
id: Helm chart untuk Fluentd

source: Helm chart for Grafana
id: Helm chart untuk Grafana

source: Helm chart for Kibana
id: Helm chart untuk Kibana

source: Helm chart for Prometheus
id: Helm chart untuk Prometheus

source: Helm charts for any appropriate Prometheus exporters
id: Helm chart untuk eksportir Prometheus yang tepat

source: Helm charts for which we are building images in osh-images. (Called further ``Category B`` helm charts)
id: helm chart dimana kami sedang membangun gambar dalam gambar-osh. (Disebut lebih lanjut ``Category B`` helm chart)

source: Helm charts for which we use official upstream images. (Called further ``Category A`` helm charts)
id: Helm chart yang kami gunakan menggunakan image hulu resmi. (Disebut lebih lanjut ``Category A`` helm chart)

source: Helm must be installed
id: Helm harus dipasang

source: Helm test is the building block for all gating. Each chart must integrate a helm-test script which validates proper functionality. This is already a merge criterion for new charts, but a handful of older charts still need for helm test functionality to be added. No additional charts will be merged prior to 1.0 unless they meet this requirement (and others in this document).
id: Tes helm adalah blok bangunan untuk semua gating. Setiap chart harus mengintegrasikan skrip uji coba yang memvalidasi fungsi yang tepat. Ini sudah menjadi kriteria penggabungan untuk chart baru, tetapi beberapa chart lama masih perlu ditambahkan fungsionalitas uji helm. Tidak ada grafik tambahan yang akan digabung sebelum 1.0 kecuali mereka memenuhi persyaratan ini (dan yang lainnya dalam dokumen ini).

source: Here is a list of the current specs:
id: Berikut adalah daftar spesifikasi saat ini:

source: Host utilization: memory usage, CPU usage, disk I/O, network I/O, etc
id: Pemanfaatan host: penggunaan memori, penggunaan CPU, disk I / O, I / O jaringan, dll

source: Hosts must use KubeDNS / CoreDNS for resolution
id: Host harus menggunakan KubeDNS / CoreDNS untuk resolusi

source: I propose to extend the conf schema with generic software information. For example, for apache2:
id: Saya mengusulkan untuk memperluas skema conf dengan informasi perangkat lunak umum. Misalnya, untuk apache2:

source: Identify etcd performance that could lead to cluster instability
id: Identifikasi kinerja etcd yang dapat menyebabkan ketidakstabilan cluster

source: Identify issues with Kubernetes components, such as: etcd, CNI, scheduler, etc
id: Identifikasi masalah dengan komponen Kubernetes, seperti: etcd, CNI, scheduler, dll

source: Identify issues with infrastructure components, such as RabbitMQ, mariadb, etc
id: Identifikasi masalah dengan komponen infrastruktur, seperti RabbitMQ, mariadb, dll

source: Identify opportunities for improving Prometheus's operation over time
id: Identifikasi peluang untuk meningkatkan operasi Prometheus dari waktu ke waktu

source: If .Values.endpoints.oci_image_registry.auth.enabled will be set to true, then any containers created with the current service account will have the ``imagePullSecrets`` automatically added to their spec and the secret will be passed to kubelet to be used for pulling images.
id: Jika .Values.endpoints.oci_image_registry.auth.enabled akan disetel ke true, maka setiap kontainer yang dibuat dengan akun layanan saat ini akan memiliki ``imagePullSecrets`` secara otomatis ditambahkan ke spesifikasi mereka dan rahasia akan diteruskan ke kubelet untuk digunakan untuk menarik image.

source: If :code:`.Values.manifests.daemonset_ovs_agent` will be set to false, neutron ovs agent would not be launched. In that matter, other type of L2 or L3 agent on compute node can be run.
id: If :code:`.Values.manifests.daemonset_ovs_agent` akan disetel ke false, agen neutron ovs tidak akan diluncurkan. Dalam hal ini, agen L2 atau L3 jenis lain pada node komputasi dapat dijalankan.

source: Implement decomposable Neutron chart
id: Terapkan chart Neutron terurai (decomposable)

source: Implementation
id: Pelaksanaan

source: In a secured deployment, TLS certificates are used to protect the transports amongst the various components. In some cases, this requires additional mechanism to handle TLS offloading and to terminate the connection gracefully:
id: Dalam penyebaran yang aman, sertifikat TLS digunakan untuk melindungi transportasi di antara berbagai komponen. Dalam beberapa kasus, ini membutuhkan mekanisme tambahan untuk menangani pemuatan TLS dan untuk mengakhiri koneksi dengan lembut:

source: In above example OVS and Neutron OVS agent are disabled.
id: Dalam contoh di atas agen OVS dan Neutron OVS dinonaktifkan.

source: In all cases, we will need to provide different ``profiles`` (in other words, overrides), to test different image providers use cases in CI.
id: Dalam semua kasus, kami akan perlu memberikan ``profil`` yang berbeda (dengan kata lain, override), untuk menguji berbagai kasus penggunaan penyedia image dalam CI.

source: In order to maximize flexibility for operators, and to help facilitate upgrades to newer versions of containerized software without editing the chart itself, all configuration files will be specified dynamically based on `values.yaml` and overrides. In most cases the config files will be generated based on the YAML values tree itself, and in some cases the config file content will be specified in `values.yaml` as a string literal.
id: Untuk memaksimalkan fleksibilitas bagi operator, dan untuk membantu memfasilitasi upgrade ke versi yang lebih baru dari perangkat lunak containerized tanpa mengedit chart itu sendiri, semua file konfigurasi akan ditentukan secara dinamis berdasarkan pada `values.yaml` dan override. Dalam kebanyakan kasus file config akan dihasilkan berdasarkan pada YAML values tree itu sendiri, dan dalam beberapa kasus konten file config akan ditentukan dalam `values.yaml` sebagai string literal.

source: In particular, these charts must move to OpenStack-Helm-Infra:
id: Secara khusus, chart ini harus pindah ke OpenStack-Helm-Infra:

source: In the current openstack-helm, all charts provide an ``images:`` section in their ``values.yaml`` that have the container images references. By default, the container images are all downloaded from a registry hosted by Docker or Quay. However, the image references can be overridden by operators to download images from any OCI image registry. In the case that the OCI image registry has authentication turned on, kubelet would fail to download the images because the current Openstack-Helm does not provide a way to pass the OCI image registry credentials to kubernetes when pulling images.
id: Di openstack-helm saat ini, semua chart menyediakan bagian ``images:`` di ``values.yaml`` mereka yang memiliki referensi image kontainer. Secara default, semua image kontainer diunduh dari registri yang diselenggarakan oleh Docker atau Quay. Namun, referensi image dapat diganti oleh operator untuk mengunduh image dari registri image OCI. Jika registry image OCI telah dihidupkan otentikasi, kubelet akan gagal mengunduh image karena Openstack-Helm saat ini tidak menyediakan cara untuk meneruskan kredensial registri image OCI ke kubernet ketika menarik image.

source: Include the URL of your Storyboard RFE:
id: Sertakan URL RF Storyboard Anda:

source: Installing OVS requires Kubernetes worker node labeling with tag :code:`openvswitch=enabled`. To mark nodes where LB should be used, new tag will be introduced: :code:`linuxbridge=enabled`.
id: Instalasi OVS membutuhkan pelabelan node Kubernetes worker dengan tag :code:`openvswitch=enabled`. Untuk menandai node tempat LB harus digunakan, tag baru akan diperkenalkan: :code:`linuxbridge=enabled`.

source: Instead of using nginx, haproxy can be used instead.
id: Daripada menggunakan nginx, haproxy dapat digunakan sebagai gantinya.

source: Introducing a new SDN solution should consider how the above services are provided. It may be required to disable the built-in Neutron functionality.
id: Memperkenalkan solusi SDN baru harus mempertimbangkan bagaimana layanan di atas disediakan. Mungkin diperlukan untuk menonaktifkan fungsionalitas Neutron bawaan (built-in).

source: It is important to notice that the helm charts can be split in two categories for now:
id: Penting untuk diperhatikan bahwa chart helm dapat dibagi menjadi dua kategori untuk saat ini:

source: Kubernetes metrics: pod status, replica availability, job status, etc
id: Metrik Kubernetes: status pod, ketersediaan replika, status pekerjaan, dll

source: Kubernetes must enable mount propagation (until it is enabled by default)
id: Kubernet harus mengaktifkan propagasi mount (sampai diaktifkan secara default)

source: L3 routing - creation of routers
id: L3 routing - pembuatan router

source: Labels assigned to nodes: node1, node2, node3:
id: Label diberikan ke node: node1, node2, node3:

source: Labels assigned to nodes: node4, node5, node6:
id: Label diberikan ke node: node4, node5, node6:

source: Labels for mon, osd, rgw, mgr and job have been updated for tenant Ceph.
id: Label untuk mon, osd, rgw, mgr dan pekerjaan telah diperbarui untuk tenant Ceph.

source: Let's consider how new SDN can take advantage of disaggregated Neutron services architecture. First assumption is that neutron-server functionality would be common for all SDNs, as it provides networking API, database management and Keystone interaction. Required modifications are:
id: Mari kita pertimbangkan bagaimana SDN baru dapat memanfaatkan arsitektur layanan Neutron terpilah (disaggregated). Asumsi pertama adalah bahwa fungsionalitas server neutron akan umum untuk semua SDN, karena menyediakan API jaringan, manajemen basis data, dan interaksi Keystone. Modifikasi yang diperlukan adalah:

source: LinuxBridge installation with neutron chart takes advantaged of decomposable neutron chart in OSH. LinuxBridge agent will be added as daemonset, similarly how OVS is implemented. New value :code:`daemonset_lb_agent` should be added in :code:`neutron/values.yaml` in :code:`manifests` section:
id: Instalasi LinuxBridge dengan chart neutron mengambil keuntungan dari chart neutron decomposable di OSH. Agen LinuxBridge akan ditambahkan sebagai daemonset, sama seperti bagaimana OVS diimplementasikan. Nilai baru :code:`daemonset_lb_agent` harus ditambahkan dalam :code:`neutron/values.yaml` di hagian :code:`manifests``:

source: LinuxBridge should be also enabled in :code:`manifests` section:
id: LinuxBridge juga harus diaktifkan di bagian :code:`manifests` :

source: LinuxBridge should support external bridge configuration, as well as auto bridge add mechanism implemented for OVS.
id: LinuxBridge harus mendukung konfigurasi jembatan eksternal, serta mekanisme penambahan jembatan otomatis yang diterapkan untuk OVS.
