Repository: zhen00fa/helm-openstack
Catalog: openstack-helm/doc/source/locale/*/LC_MESSAGES/doc-specs.po
Languages: id

source: Update helm-toolkit serviceaccount template to pass the secret in a conditional
id: Update templat akun layanan helm-toolkit untuk memberikan rahasia secara bersyarat

source: Update helm-toolkit to provide manifest to create secret for registry authentication
id: Update helm-toolkit untuk menyediakan manifes untuk membuat rahasia untuk otentikasi registri

source: Update of Developer Documentation
id: Update Dokumentasi Pengembang

source: Update of Makefile for OpenStack-Helm-Infra to allow modular deployment of components
id: Update Makefile untuk OpenStack-Helm-Infra sehingga memungkinkan penempatan komponen secara modular

source: Update of developer documentation
id: Update dokumentasi pengembang

source: Update relevant Documentation.
id: Update Dokumentasi yang relevan.

source: Update script as following:
id: Update skrip sebagai berikut:

source: Update script overrides as following:
id: Update override skrip sebagai berikut:

source: Update script to include namespace ``tenant-ceph`` as shown below.
id: Update skrip untuk memasukkan namespace ``tenant-ceph`` seperti yang ditunjukkan di bawah ini.

source: Update script with following overrides.
id: Update skrip dengan override berikut.

source: Update script with following overrides:
id: Update skrip dengan override berikut:

source: Update script's override section with following:
id: Update bagian override skrip dengan yang berikut:

source: Update service charts to use the updated ``helm toolkit``.
id: Perbarui chart layanan untuk menggunakan yang diperbarui ``helm toolkit``.

source: Use Cases
id: Use Case

source: Use cases
id: Gunakan kasus

source: Use default overrides and execute following scripts as per OSH guide steps:
id: Gunakan override default dan jalankan skrip berikut sesuai langkah panduan OSH:

source: VM networking performance would be dependent of SDN used.
id: Kinerja jaringan VM akan tergantung pada SDN yang digunakan.

source: VM networking performance would be dependent on linux bridge implementation.
id: Kinerja jaringan VM akan tergantung pada implementasi jembatan linux.

source: Values File Ordering
id: Nilai Pengurutan File

source: Version requirements for the following must be documented and maintained:
id: Persyaratan versi untuk yang berikut ini harus didokumentasikan dan dipelihara:

source: Visualize logged events to determine if an event is recurring or an outlier
id: Visualisasikan event yang dicatat untuk menentukan apakah suatu event berulang atau outlier

source: Visualize performance to identify trends in traffic or utilization over time
id: Visualisasikan kinerja untuk mengidentifikasi tren lalu lintas atau pemanfaatan seiring waktu

source: We are disabling rbd and cephfs provisioners.
id: Kami menonaktifkan provisioner rbd dan cephfs.

source: We need to adapt all the helm charts to remove the hard-coded bits, be image agnostic, to allow users to bring their own images.
id: Kita perlu mengadaptasi semua bagan helm untuk menghapus bit yang dikodekan, menjadi agnostik image, untuk memungkinkan pengguna membawa image mereka sendiri.

source: When possible, ``values_overrides/`` will refer to existing ``helm-toolkit`` functions to avoid repeating ourselves.
id: Jika memungkinkan, ``values_overrides/`` akan merujuk ke fungsi ``helm-toolkit`` yang ada untuk menghindari pengulangan diri.

source: Work is underway to refactor common manifest patterns into reusable snippets in Helm-Toolkit. The following manifests have yet to be combined:
id: Pekerjaan sedang dilakukan untuk memperbaiki pola manifes umum menjadi potongan yang dapat digunakan kembali di Helm-Toolkit. Manifes berikut belum digabungkan:

source: ``cephfs_provisioner: false`` and ``provision_storage_class: false`` are set to false to disable cephfs. ``deployment_mds: false`` is set to disable ceph-mds
id: ``cephfs_provisioner: false`` dan ``provision_storage_class: false`` disetel ke false untuk menonaktifkan cephfs. ``deployment_mds: false`` diatur untuk menonaktifkan ceph-mds.

source: ``k8s node list with labels`` After applying above labels, node labels should look like following.
id: ``k8s node list with labels`` Setelah menerapkan label di atas, label node akan terlihat seperti berikut.

source: bootstrap * sub-keys (alphabetical order)
id: bootstrap * sub-keys (sesuai abjad)

source: dependencies * sub-keys (alphabetical order)
id: dependencies * sub-keys (sesuai abjad)

source: endpoints * sub-keys (alphabetical order)
id: endpoints * sub-keys (sesuai abjad)

source: fluentbit-fluentd logging architecture
id: arsitektur logging fluentbit-fluentd

source: images * sub-keys (alphabetical order)
id: images * sub-keys (sesuai abjad)

source: labels * sub-keys (alphabetical order)
id: labels * sub-keys (sesuai abjad)

source: manifests * sub-keys (alphabetical order)
id: manifests * sub-keys (sesuai abjad)

source: mattmceuen (Matt McEuen <matt.mceuen@att.com>) for coordination
id: mattmceuen (Matt McEuen <matt.mceuen@att.com>) untuk koordinasi

source: mon_addr and mon_host have non default mon port 6790.
id: mon_addr and mon_host memiliki port mon standar 6790.

source: monitoring * sub-keys (alphabetical order)
id: monitoring * sub-keys (sesuai abjad)

source: network * sub-keys (alphabetical order)
id: network * sub-keys (sesuai abjad)

source: no ceph-mds and ceph-rgw
id: no ceph-mds dan ceph-rgw

source: pod * sub-keys (alphabetical order)
id: pod * sub-keys (sesuai abjad)

source: portdirect (Pete Birley <pete@port.direct>) for the release management spec [2]_
id: portdirect (Pete Birley <pete@port.direct>) untuk spesifikasi manajemen rilis [2] _

source: powerds (DaeSeong Kim <daeseong.kim@sk.com>) for the `values.yaml` ordering spec [1]_
id: powerds (DaeSeong Kim <daeseong.kim@sk.com>) untuk `values.yaml` ordering spec [1]_

source: randeep.jalli (Randeep Jalli <rj2083@att.com>) and renmak (Renis Makadia <renis.makadia@att.com>) for splitting up the Ceph chart
id: randeep.jalli (Randeep Jalli <rj2083@att.com>) dan renmak (Renis Makadia <renis.makadia@att.com>) untuk membagi chart Ceph

source: rwellum (Rich Wellum <richwellum@gmail.com>) for coordination of Storyboard adoption
id: rwellum (Rich Wellum <richwellum@gmail.com>) untuk koordinasi adopsi Storyboard

source: secrets * sub-keys (alphabetical order)
id: secrets * sub-keys (sesuai abjad)

source: services do not handle TLS offloading and termination,
id: layanan tidak menangani pemuatan dan pemutusan TLS,

source: services whose native handling of TLS offloading and termination cause major performance impact, for example, eventlet.
id: layanan dengan penanganan native pemuatan dan pemutusan TLS menyebabkan dampak kinerja utama, misalnya, eventlet.

source: the impact of adding extra conditionals in the helm charts, to deal with multi-distro aspect (if not using the approach above, or when using an alternative approach)
id: dampak dari penambahan persyaratan extra di helm chart, untuk menangani aspek multi-distro (jika tidak menggunakan pendekatan di atas, atau ketika menggunakan pendekatan alternatif)

source: the impact of adding functionality in the ``helm-toolkit`` to deal with a common multi-distro aspect (could possibly increase helm chart rendering time)
id: dampak dari penambahan fungsionalitas dalam ``helm-toolkit`` untuk menangani aspek multi-distro yang umum (mungkin dapat meningkatkan waktu rendering chart helm)

source: the impact of exposing extra key/values in the helm chart ``values.yaml`` file (could possibly have a deployment speed/ram usage increase).
id: dampak dari mengekspos key/value tambahan dalam file helm ``values.yaml`` (mungkin bisa memiliki kecepatan deployment / peningkatan penggunaan ram).
